Repository: pyladies/global-conference-2025
Catalog: locales/*/messages.po
Languages: cs, es, fr, pt

source: <code class="text-blue-400">#resources</code>, for sharing python-related resources,
cs: <code class="text-blue-400">#resources</code>, pro sdílení materiálů ohledně Pythonu,
es: <code class="text-blue-400">#resources</code>, para compartir recursos relacionados con Python,
fr: <code class="text-blue-400">#resources</code>, pour partager des ressources liées à Python,
pt: <code class="text-blue-400">#resources</code>, para partilhar recursos relacionados com Python,

source: <code class="text-blue-400">#news-discussion</code>, to interact with the latest Python/PyLadies blog posts,
cs: <code class="text-blue-400">#news-discussion</code>, kde se můžete bavit o posledních blog postech Pythonu a PyLadies,
es: <code class="text-blue-400">#news-discussion</code>, para interactuar con las últimas publicaciones del blog de Python/PyLadies,
fr: <code class="text-blue-400">#news-discussion</code>, pour intéeragir avec les derniers articles du blog de Python/PyLadies,
pt: <code class="text-blue-400">#news-discussion</code>, para interagir com as últimas publicações do blog Python/PyLadies,

source: <code class="text-blue-400">#help</code>, in case you need help with something,
cs: <code class="text-blue-400">#help</code>, pokud potřebujete s něčím pomoct,
es: <code class="text-blue-400">#help</code>, por si necesitas ayuda con algo,
fr: <code class="text-blue-400">#help</code>, au cas où vous aurez besoin de quelque chose,
pt: <code class="text-blue-400">#help</code>, caso precises de ajuda com alguma coisa,

source: <code class="text-blue-400">#ask-core-devs</code>, for you to meet and ask the many Python Core developers that will be around,
cs: <code class="text-blue-400">#ask-core-devs</code>, kde se můžete sejít s core developery Pythonu, kteří navštíví naši konferenci,
es: <code class="text-blue-400">#ask-core-devs</code>, para que conozcas y preguntes a los desarrolladores principales de Python que estarán presentes,
fr: <code class="text-blue-400">#ask-core-devs</code>, pour vous de rencontrer et poser des questions aux développeur.ses principaux.les qui seront présent.es,
pt: <code class="text-blue-400">#ask-core-devs</code>, para conheceres e perguntares aos muitos Python Core developers que estarão por lá,

source: <code class="text-blue-400">#game</code>, for a little game we have prepared for you,
cs: <code class="text-blue-400">#game</code>, kde najdete malou hru, kterou jsme pro vás připravili,
es: <code class="text-blue-400">#game</code>, para un pequeño juego que hemos preparado para ti,
fr: <code class="text-blue-400">#game</code>, pour un petit jeu que nous vous avons préparé,
pt: <code class="text-blue-400">#game</code>, para um pequeno jogo que preparámos para ti,

source: <code class="text-blue-400">#game-ranking</code>, to see the ranking of the game!,
cs: <code class="text-blue-400">#game-ranking</code>, kde najdete ranking hry!,
es: <code class="text-blue-400">#game-ranking</code>, ¡para ver la clasificación del juego!,
fr: <code class="text-blue-400">#game-ranking</code>, pour voir le classement du jeu!,
pt: <code class="text-blue-400">#game-ranking</code>, para ver a classificação do jogo!,

source: And more importantly, you also will have channels related to the tracks of the conference:
cs: Neméně důležité jsou kanály související se samotnou konferenci:
es: Y lo que es más importante, también dispondrás de canales relacionados con los temas de la conferencia:
fr: Et surtout, vous aurez également accès à des canaux liées aux thèmes de la conférence :
pt: E mais importante, também terás canais relacionados com as trilhas da conferência:

source: <code class="text-blue-400">#main-stream</code>, for the main conference track,
cs: <code class="text-blue-400">#main-stream</code>, pro hlavní konferenční tematický okruh,
es: <code class="text-blue-400">#main-stream</code>, para la sección principal de la conferencia,
fr: <code class="text-blue-400">#main-stream</code>, pour le thème de la conférence principale,
pt: <code class="text-blue-400">#main-stream</code>, para a trilha principal da conferência,

source: <code class="text-blue-400">#activities-open-spaces</code>, for the track for Activities, Workshops, and Open Spaces,
cs: <code class="text-blue-400">#activities-open-spaces</code>, pro Aktivity, Workshopy a Open Spaces,
es: <code class="text-blue-400">#activities-open-spaces</code>, para la sección de actividades, talleres y espacios abiertos,
fr: <code class="text-blue-400">#activities-open-spaces</code>, pour la session les activités, ateliers, and développements participatifs,
pt: <code class="text-blue-400">#activities-open-spaces</code>, para a trilha de Atividades, Workshops e Espaços Abertos,

source: General Enforcing Procedure
cs: Obecný proces prosazování
es: Procedimiento general de ejecución
fr: Procédure générale applicable
pt: Procedimento Geral de Aplicação

source: This document summarizes the procedures the PyLadiesCon CoC team uses to enforce the Code of Conduct.
cs: Tento dokument shrnuje proces, který tým CoC na PyLadiesCon používá k prosazování Code of Conduct.
es: Este documento resume los procedimientos que utiliza el equipo del CoC de PyLadiesCon para hacer cumplir el Código de conducta.
fr: Ce document résume les procédures utilisées par l'équipe PyLadiesCon CoC pour faire respecter le code de conduite.
pt: Este documento resume os procedimentos que a equipa de CdC da PyLadiesCon usa para aplicar o Código de Conduta.

source: General Reporting Procedure
cs: Obecný proces reportování
es: Procedimiento general de reporte
pt: Procedimento Geral de Denúncia

source: Steps for doing a proper report of an event that happened in the conference
cs: Podrobný postup, jak reportovat události, které se staly během konference
es: Pasos para realizar un informe adecuado de un evento ocurrido en la conferencia
fr: Étapes à suivre pour rédiger un rapport correct sur un événement qui s'est produit lors de la conférence
pt: Passos para fazer uma denúncia adequada de um evento que aconteceu na conferência

source: PyLadiesCon is a community conference intended for networking and collaboration. We aim to provide a safe, inclusive, welcoming, and harassment-free for everyone in our community.
cs: PyLadiesCon je komunitní konference zaměřená na spolupráci a networking. Chceme, aby prostředí konference bylo bezpečně, inkluzivní a otevřené pro každou a každého v naší komunitě.
es: PyLadiesCon es una conferencia comunitaria destinada a la creación de redes y la colaboración. Nuestro objetivo es proporcionar un entorno seguro, inclusivo, acogedor y libre de acoso para todas las personas de nuestra comunidad.
fr: PyLadiesCon est une conférence communautaire destinée au réseautage et à la collaboration. Nous visons à offrir un environnement sûr, inclusif, accueillant et exempt d'harcèlement pour tous les membres de notre communauté.
pt: A PyLadiesCon é uma conferência comunitária destinada ao networking e colaboração. O nosso objetivo é proporcionar um ambiente seguro, inclusivo, acolhedor e livre de assédio para todos na nossa comunidade.

source: We want all participants to have an enjoyable and fulfilling experience. Accordingly, all participants are expected to show respect and courtesy to other participants throughout the conference and at all conference-related events and activities.
cs: Chceme, aby veškeré účastnictvo prožilo příjemný čas na konferenci. Proto všechny žádáme o respektující chování vůči ostatním účastnicím a účastníků po dobu celé konference na všech konferenčních aktivitách a akcích.

source: To make clear what is expected, all members of the organizing committee, attendees, speakers, organizers, sponsors, and volunteers at any PyLadiesCon event are required to conform to the following Code of Conduct as set forth by the Python Software Foundation. Organizers will enforce this code throughout the event.
cs: Abychom měli společný základ, co je na konferencí přípustné, všechno členstvo organizačního týmu, účastnictvo, přednášející, sponzoři a dobrovolnictvo na PyLadiesCon musí postupovat podle zde sepsaného Code of Conduct, nastaveného Python Software Foundation. Organizátorský tým bude vyžadovat chování v souladu s tímto dokumentem po celou dobu konference.

source: The Python community is made up of members from around the globe with a diverse set of skills, personalities, and experiences. It is through these differences that our community experiences great successes and continued growth. When you're working with members of the community, this Code of Conduct will help steer your interactions and keep Python a positive, successful, and growing community.
cs: Python komunita sestává s členstva z celého světa, lidi s různými schopnostmi, osobnostmi a zkušenostmi. Právě díky těmto rozdílům je naše komunita úspěšná a roste. Když pracujete s členy komunity, tento Code of Conduct vám pomůže naladit vaše interakce tak, aby pomohly rozvíjet naši komunitu v pozitivním a úspěšném duchu i nadále.

source: Our Community
cs: Naše komunita
es: Nuestra Comunidad
fr: Notre communauté
pt: A nossa Comunidade

source: Members of the Python community are open, considerate, and respectful. Behaviors that reinforce these values contribute to a positive environment, and include:
cs: Členstvo Python komunity je otevřené a respektující. Chování, které podporuje tyto hodnoty, pomáhá tvořit pozitivní prostředí, a zahrnuje:
es: Las personas que son parte de la comunidad Python son abiertas, consideradas y respetuosas. Los comportamientos que refuerzan estos valores contribuyen a un entorno positivo e incluyen:
fr: Les membres de la communauté Python sont ouverts, prévenants et respectueux. Les comportements qui renforcent ces valeurs contribuent à créer un environnement positif et comprennent :
pt: Os membros da comunidade Python são abertos, atenciosos e respeitosos. Comportamentos que reforçam estes valores contribuem para um ambiente positivo, e incluem:

source: <strong class="text-pink">Being open.</strong> Members of the community are open to collaboration, whether it's on PEPs, patches, problems, or otherwise.
cs: <strong class="text-pink">Budťe otevření.</strong> Členstvo komunity je otevřené k spolupráci, ať je to spolupráce u PEP, patchů, řešení problémů a dalších.

source: <strong class="text-pink">Focusing on what is best for the community.</strong> We're respectful of the processes set forth in the community, and we work within them.
cs: <strong class="text-pink">Soustřeďte se na to, co je nejlepší pro komunitu</strong> Respektujeme procesy nastavené v komunitě a pracujeme v jejich rámci.

source: <strong class="text-pink">Acknowledging time and effort.</strong> We're respectful of the volunteer efforts that permeate the Python community. We're thoughtful when addressing the efforts of others, keeping in mind that often times the labor was completed simply for the good of the community.
cs: <strong class="text-pink">Uznání času a úsilí.</strong> Respektujeme úsilí dobrovolnictva, které prolíná celou Python komunitu. Jsme opatrní, když se vyjadřujeme o úsilí ostatních, pamatujeme si, že častokrát jedinou motivací jejich práce bylo dobro komunity.

source: <strong class="text-pink">Being respectful of differing viewpoints and experiences.</strong> We're receptive to constructive comments and criticism, experiences and skill sets of other members contribute to the whole of our efforts.
cs: <strong class="text-pink">Respektujte rozdílné názory a zkušenosti.</strong> Přijímáme konstruktivní komentáře a kritiku, zkušenosti a schopnosti ostatních členů a členek komunity posouvají naše projekty vpřed.

source: <strong class="text-pink">Showing empathy towards other community members.</strong> We're attentive in our communications, whether in person or online, and we're tactful when approaching differing views.
cs: <strong class="text-pink">Projevujte empatii vůči ostatnímu členstvu komunity.</strong> Dáváme pozor během rozhovorů, ať už online nebo osobně, a taktně adresujeme rozdílné názory na věc.

source: <strong class="text-pink">Being considerate.</strong> Members of the community are considerate of their peers – other Python users.
cs: <strong class="text-pink">Buďte ohleduplní.</strong> Členstvo komunity je ohleduplné k sobě navzájem.

source: <strong class="text-pink">Being respectful.</strong> We're respectful of others, their positions, their skills, their commitments, and their efforts.
cs: <strong class="text-pink">Respektujte ostatní.</strong> S respektem přistupujeme k ostatním, jejich názorům, schopnostem, závazkům a úsilí.

source: <strong class="text-pink">Gracefully accepting constructive criticism.</strong> When we disagree, we are courteous in raising our issues.
cs: <strong class="text-pink">Akceptujte konstruktivní kritiku.</strong> Když spolu nesouhlasíme, jsme zdvořilí při vznášení námitek.

source: <strong class="text-pink">Using welcoming and inclusive language.</strong> We're accepting of all who wish to take part in our activities, fostering an environment where anyone can participate and everyone can make a difference.
cs: <strong class="text-pink">Použivejte inkluzivní jazyk.</strong> Akceptujeme všechny, kdo se chtějí stát součástí našich aktivit a chceme tvořit prostředí, kde se každý a každá cítí vítaně.

source: Our Standards
cs: Naše standardy

source: Every member of our community has the right to have their identity respected. The Python community is dedicated to providing a positive experience for everyone, regardless of age, gender identity and expression, sexual orientation, disability, physical appearance, body size, ethnicity, nationality, race, or religion (or lack thereof), education, or socio-economic status.
cs: Každá členka a každý člen komunity má nárok na respektování své identity. Komunita Pythonu tvoří prostředí, které zajišťuje pozitivní zkušenost pro všechny, nehledě na věk, genderovou identitu a projev, sexuální orientaci, invaliditu, vzhled, velikost těla, etnikum, národnost, rasu nebo náboženství (nebo jeho absenci), vzdělání a společensko-ekonomický status.

source: Inappropriate Behavior
cs: Nepřípustné chování

source: Consequences
cs: Následky

source: Scope
cs: Rozsah

source: Our Process
cs: Náš proces

source: Reporting an Incident
cs: Nahlášení událostí

source: Procedure for handling incidents
cs: Proces projednání záležitostí

source: License
cs: Licence

source: Attribution
cs: Atribuce

source: Support PyLadiesCon
cs: Podpořte PyLadiesCon
es: Apoya PyLadiesCon
fr: Soutenir PyLadiesCon
pt: Apoia a PyLadiesCon

source: Make a Donation
cs: Pošlete příspěvek
es: Haz una Donación
fr: Faire un don
pt: Faz um Donativo

source: PyLadiesCon is an exciting online event dedicated to empowerment, learning, and diversity within the Python community. Organized by PyLadies, a global mentorship group helping more women become active participants and leaders in the Python open source community, your donation will help improve the diversity of the software industry as a whole.
cs: PyLadiesCon je významná online událost věnovaná empowermentu, vzdělání a diverzitě v Python komunitě. Organizovaná PyLadies, globální mentorskou skupinou zaměřenou na pomoc ženám stát se aktivními členkami a lídryněmi v open source komunitě Pythonu. Vaše dotace nám pomůže zvýšit diverzitu softwarového průmyslu jako celku.
es: PyLadiesCon es un emocionante evento en línea dedicado al empoderamiento, el aprendizaje y la diversidad dentro de la comunidad Python. Organizado por PyLadies, un grupo global de mentoría que ayuda a más mujeres a convertirse en participantes activas y líderes en la comunidad de código abierto de Python, tu donación contribuirá a mejorar la diversidad de la industria del software en su conjunto.
fr: PyLadiesCon est un événement en ligne passionnant dédié à l'autonomisation, à l'apprentissage et à la diversité au sein de la communauté Python. Organisé par PyLadies, un groupe mondial de mentorat qui aide davantage de femmes à devenir des participantes actives et des leaders dans la communauté open source Python, votre don contribuera à améliorer la diversité de l'industrie du logiciel dans son ensemble.
pt: A PyLadiesCon é um evento online emocionante dedicado ao empoderamento, aprendizagem e diversidade dentro da comunidade Python. Organizado pela PyLadies, um grupo global de mentoria que ajuda mais mulheres a tornarem-se participantes ativas e líderes na comunidade open source Python, o teu donativo ajudará a melhorar a diversidade da indústria de software como um todo.

source: Global Reach
cs: Globální dosah
es: Alcance Global
fr: Portée mondiale
pt: Alcance Global

source: Help us bring PyLadies communities together from around the world.
cs: Pomůžete nám shromáždit na jednom místě komunity PyLadies z celého světa.
es: La conferencia en línea de las comunidades de PyLadies en todo el mundo.
fr: Aidez-nous à rassembler les communautés PyLadies du monde entier.
pt: Ajuda-nos a reunir as comunidades PyLadies de todo o mundo.

source: Free Access
cs: Přístup zdarma
es: Acceso gratuito
fr: Libre accès
pt: Acesso Gratuito

source: Keep the conference free and accessible to all participants.
cs: Udržíte konferenci přístupnou zdarma pro všechny účastnice a účastníky.
es: Mantengamos la conferencia gratuita y accesible para todos los participantes.
fr: Assurez la gratuité et l'accessibilité de la conférence pour tous.tes les participant.e.s.
pt: Mantém a conferência gratuita e acessível a todos os participantes.

source: Community Support
cs: Podpora komunity
es: Soporte de la Comunidad
fr: Soutien communautaire
pt: Apoio à Comunidade

source: Support the PyLadies community and help organize future events.
cs: Podpoříte komunitu PyLadies a pomůžete nám organizovat budoucí události.
es: Apoya a la comunidad PyLadies y ayuda a organizar futuros eventos.
fr: Soutenez la communauté PyLadies et contribuez à l'organisation d'événements futurs
pt: Apoia a comunidade PyLadies e ajuda a organizar eventos futuros.

source: Donation Form
cs: Formulář pro poslání příspěvku
es: Formulario de Donación
fr: Formulaire de don
pt: Formulário de Donativo

source: All donations go directly to supporting PyLadiesCon and are managed by the Python Software Foundation.
cs: Všechny příspěvky přímo podpoří PyLadiesCon a jsou spravovány Python Software Foundation.
es: Todas las donaciones se destinan directamente a apoyar PyLadiesCon y son gestionadas por la Python Software Foundation.
fr: Tous les dons sont directement reversés à PyLadiesCon et gérés par la Python Software Foundation.
pt: Todos os donativos vão diretamente para apoiar a PyLadiesCon e são geridos pela Python Software Foundation.

source: Ready to Make a Difference?
cs: Jste připravení udělat rozdíl?
es: Lista para hacer la diferencia?
fr: Prêt à faire la différence ?
pt: Pronto para Fazer a Diferença?

source: Click the button below to proceed to our donation form. You'll be redirected to the Python Software Foundation's payment system.
cs: Klikněte na odkaz vedoucí na náš příspěvkový formulář. Budete přesměrovaní do platebního systému Python Software Foundation.
es: Haz clic en el botón de abajo para acceder a nuestro formulario de donación. Serás redirigida al sistema de pago de la Python Software Foundation.
fr: Cliquez sur le bouton ci-dessous pour accéder à notre formulaire de don. Vous serez redirigé. au système de paiement de la Python Software Foundation.
pt: Clica no botão abaixo para prosseguir para o nosso formulário de donativo. Serás redirecionado para o sistema de pagamento da Python Software Foundation.

source: Proceed to Donation Form
cs: Pokračujte na příspěvkový formulář
es: Acceder al formulario de donación
fr: Passer au formulaire de don
pt: Prosseguir para o Formulário de Donativo

source: Payment is processed securely via PayPal or physical check (US only)
cs: Platba je bezpečně zprocesovaná PayPalem nebo fyzickým šekem (pouze v USA)
es: El pago se procesa de forma segura a través de PayPal o cheque físico (solo en EEUU).
fr: Le paiement est traité de manière sécurisée via PayPal ou par chèque papier (États-Unis uniquement).
pt: O pagamento é processado de forma segura via PayPal ou cheque físico (apenas EUA)

source: The Python Software Foundation is a 501(c)(3) non-profit organization. Donations may be tax-deductible.
cs: Python Software Foundation je non-profit organizací dle 501(c)(3). Příspěvky můžou být odečitatelné od daně.
es: La Python Software Foundation es una organización sin fines de lucro 501(c)(3). Las donaciones pueden ser deducibles de impuestos.
fr: La Python Software Foundation est une organisation à but non lucratif régie par l'article 501(c)(3) du code fiscal américain. Les dons peuvent être déductibles des impôts.
pt: A Python Software Foundation é uma organização sem fins lucrativos 501(c)(3). Os donativos podem ser dedutíveis nos impostos.

source: Other Ways to Support
cs: Jiné způsoby podpory
es: Otras formas de dar apoyo
fr: Autres moyens de nous soutenir
pt: Outras Formas de Apoiar

source: Become a sponsor - contact us at
cs: Staňte se sponzorem - kontaktujte nás na
es: Conviértete en sponsor - contáctanos en
fr: Devenez sponsor - contactez-nous sur
pt: Torna-te um patrocinador - contacta-nos em

source: Volunteer your time and skills to help organize the conference
cs: Přispějte svým časem a schopnostmi a pomozte nám zorganizovat konferenci
es: Ofrece tu tiempo y tus habilidades como voluntaria para ayudar a organizar la conferencia
fr: Mettez à profit vos compétences et votre temps pour aider à organiser la conférence
pt: Voluntaria o teu tempo e competências para ajudar a organizar a conferência

source: Spread the word about PyLadiesCon on social media
cs: Sdílejte informace o PyLadiesCon na svých social mediích
es: Comparte información sobre PyLadiesCon en las redes sociales
fr: Partager sur les réseaux sociaux par rapport à PyLadiesCon
pt: Espalha a palavra sobre a PyLadiesCon nas redes sociais

source: Join or start a local PyLadies chapter
cs: Přidejte se do lokální skupiny PyLadies
es: Únete o crea un capítulo local de PyLadies
fr: Rejoindre ou créer un chapitre de PyLadies
pt: Junta-te ou inicia um capítulo local da PyLadies

source: Thank You for Your Support!
cs: Děkujeme za vaši podporu!
es: ¡Gracias por tu apoyo!
fr: Merci pour votre soutien !
pt: Obrigado pelo Teu Apoio!

source: Your generosity makes it possible for PyLadies communities worldwide to connect, learn, and grow together.
cs: Díky vaší hojností komunity PyLadies z celého světa se můžou sejít, vzdělávat a spolu rozvíjet.
es: Tu generosidad hace posible que las comunidades de PyLadies de todo el mundo se conecten, aprendan y crezcan juntas.
fr: Votre générosité permet aux communautés PyLadies du monde entier de se connecter, d'apprendre et de grandir ensemble.
pt: A tua generosidade torna possível que as comunidades PyLadies em todo o mundo se conectem, aprendam e cresçam juntas.

source: Find opportunities from our sponsors
cs: Najděte pracovní příležitosti od našich sponzorů
es: Encuentra oportunidades de nuestro patrocinadores
fr: Trouver des opportunités d'emploi de la part de nos sponsors
pt: Encontra oportunidades dos nossos patrocinadores

source: Job Board
cs: Nabídky práce
es: Bolsa de Trabajo
fr: Offres d'emploi
pt: Quadro de Empregos

source: -- No Jobs were added so far --
cs: -- Nebyly nalezeny žádné nabídky práce --
es: -- No se han agregado trabajos hasta ahora --
fr: -- Accun job disponible --
pt: -- Ainda não foram adicionados empregos --

source: What Awaits You at PyLadiesCon
cs: Co můžete čekat na PyLadiesCon
es: Qué te espera en PyLadiesCon
fr: L'expérience qui vous attend à PyLadiesCon
pt: O Que Te Espera na PyLadiesCon
