Repository: pyladies/global-conference-2025
Catalog: locales/*/messages.po
Languages: cs, es, fr, pt

source: This year's edition of PyLadiesCon is packed with exciting opportunities for learning and community engagement. By registering, you'll gain access to: Keynotes, Talks, Interactive Sessions & Panels, Networking, and more!
cs: Letošní edice PyLadiesCon je plná napínavých příležitostí pro vzdělání a angažování v komunitě. Po registraci získáte přístup do hlavních přednášek, přednášek, interaktivních sezení a panelů, networkingu a mnoha dalších!
es: La edición de este año de PyLadiesCon está repleta de interesantes oportunidades de aprendizaje y participación en la comunidad. Al registrarte, tendrás acceso a: ponencias principales, charlas, sesiones interactivas y paneles, oportunidades para establecer contactos y mucho más!
fr: L'édition de PyLadiesCon cette année regorge d'opportunités passionnantes pour apprendre et s'engager dans la communauté. En vous inscrivant, vous aurez accès à : des discours keynotes inspirants, des conférences, des sessions interactives et des tables rondes, des occasions de réseautage, et bien plus encore !
pt: A edição deste ano da PyLadiesCon está repleta de oportunidades emocionantes para aprendizagem e envolvimento comunitário. Ao registares-te, terás acesso a: Keynotes, Palestras, Sessões Interativas e Painéis, Networking e muito mais!

source: Local Time
cs: Místní čas
es: Hora Local
fr: Heure locale
pt: Hora Local

source: Session Types
cs: Druhy vystoupení
es: Tipos de Sesiones
fr: Types de session
pt: Tipos de Sessão

source: Keynote
cs: Hlavní přednáška
es: Ponencia Principal

source: Talk
cs: Přednáška
es: Charla
fr: Discussion (Talk)
pt: Palestra

source: Sponsor Talk
cs: Přednáška sponzora
es: Charla de Patrocinador
fr: Présentation de sponsor
pt: Palestra de Patrocinador

source: Difficulty Levels
cs: Úrovně pokročilosti
es: Niveles de dificultad
fr: Niveaux de difficultés
pt: Níveis de Dificuldade

source: Beginner
cs: Začátečnícká
es: Principiante
fr: Débutant
pt: Iniciante

source: Intermediate
cs: Středně-pokročilá
es: Intermedio
fr: Intermédiaire
pt: Intermédio

source: Advanced
cs: Pokročilá
es: Avanzado
fr: Avancée
pt: Avançado

source: Type
cs: Druh
es: Tipo
pt: Tipo

source: Room
cs: Místnost
es: Sala
fr: Salle
pt: Sala

source: Start
cs: Začátek
es: Inicio
fr: Début
pt: Início

source: End
cs: Konec
es: Fin
fr: Fin
pt: Fim

source: Duration
cs: Čas trvání
es: Duración
fr: Durée
pt: Duração

source: minutes
cs: minut
es: minutos
pt: minutos

source: Abstract
cs: Abstrakt
es: Resumen
fr: A propos
pt: Resumo

source: List of Sessions
cs: Seznam vystoupení
es: Lista de Sesiones
fr: Liste des sessions
pt: Lista de Sessões

source: Here you can find a list of all the sessions at the conference. You can filter the sessions by track, type, and level.
cs: Zde najdete seznam všech vystoupení na konferenci. Můžete je filtrovat dle tematického okruhu, typu a úrovně pokročilosti.
es: Aquí puedes encontrar una lista de todas las sesiones de la conferencia. Puedes filtrar las sesiones por track, tipo y nivel.
fr: Vous trouverez ici la liste de toutes les sessions de la conférence. Vous pouvez filtrer les sessions par thème, type et niveau
pt: Aqui podes encontrar uma lista de todas as sessões da conferência. Podes filtrar as sessões por trilha, tipo e nível.

source: Filters
cs: Filtry
es: Filtros
fr: Filtres
pt: Filtros

source: Search results
cs: Výsledky vyhledávání
es: Resultados de búsqueda
fr: Rechercher
pt: Resultados da pesquisa

source: No sessions available yet. Please check back later!
cs: Žádná vystoupení ještě zde nejsou. Zkuste to znovu později!
es: Aún no hay sesiones disponibles. ¡Por favor, vuelve más tarde!
fr: Aucune session disponible. Réessayer plus tard !
pt: Ainda não há sessões disponíveis. Por favor, volta mais tarde!

source: More About The Speaker
cs: Víc o přednášejícím
es: Más Sobre El Ponente
fr: Lire plus sur le conférencier
pt: Mais sobre a Oradora

source: Sessions by {name}
cs: Vystoupení od {name}
es: Charlas de {name}
fr: Sessions par {name}
pt: Sessões por {name}

source: We are excited to have an amazing lineup of speakers from around the world.
cs: Máme naprosto neuvěřitelné přednášející z celého světa.
es: Nos emociona tener una increíble lista de ponentes de todo el mundo.
fr: Nous sommes ravis d'accueillir un panel exceptionnel d'intervenants venus du monde entier.
pt: Estamos entusiasmados por ter um alinhamento incrível de oradoras de todo o mundo.

source: Our Speakers
cs: Naši přednášející
es: Nuestros Ponentes
fr: Nos conférenciers
pt: As nossas Oradoras

source: Our Keynotes
cs: Naše hlavní přednášející
es: Ponencias Principales
fr: Nos Keynotes
pt: Os nossos Keynotes

source: Meet our Keynote speakers
cs: Seznamte se s našimi hlavními řečnicemi
es: Conoce nuestras ponentes principales
fr: Découvrez nos conférenciers principaux
pt: Conhece as nossas oradoras de Keynote

source: Meet our Speakers
cs: Seznamte se s našimi přednášejícími
es: Conopce nuestras speakers
fr: Découvrez nos conférenciers
pt: Conhece as nossas Oradoras

source: Prospectus for the global PyLadies Conference.
cs: Leták globální konference PyLadies.
es: Prospectus de la conferencia global de PyLadies.
fr: Prospectus de la conférence globale PyLadies.
pt: Prospecto para a Conferência PyLadies global.

source: Support PyLadies as we work to improve diversity by bringing fresh talent into the Python community and to support both seasoned and budding developers through workshops, community activities, and local advocacy.
cs: Podpořte PyLadies v úsilí o zvýšení diverzity díky přilákání nového talentu do Python komunity, a v podpoře tak zkušených jak rostoucích vývojářů a vývojářek skrz workshopy, komunitní aktivity a lokální podporu.

source: Your support will help PyLadies provide financial support to help more women around the world with training, mentorship, and aid to attend conferences and community events.
cs: Díky vaší podpoře PyLadies mohou poskytnout finanční podporu ženám z celého světa při získávání tréninků, mentoringu, a jejich účast na konferencích a komunitních akcích.

source: To learn more and to join us as a sponsor, please contact us, and a member of our sponsorship team will get back to you soon. Please get in touch by writing to <a href="mailto:sponsors@pyladies.com">sponsors@pyladies.com</a>
cs: Pro více informací a nabídku sponzorování nás kontaktujte - členstvo sponzorského týmu se vám promptně ozve. Prosíme, ozvěte se nám na <a href="mailto:sponsors@pyladies.com">sponsors@pyladies.com</a>

source: Download Sponsorship Prospectus
cs: Stáhněte sponzorský leták

source: Custom Sponsorship
cs: Sponzorství na míru

source: Most requested
cs: Nejčastěji volené

source: We are also happy to customize a sponsorship package to give you the freedom to choose what you think works best in order to meet your event participation goals.
cs: Rádi připravíme sponzorský balíček na míru, ve kterém si zvolíte ty prvky propagace, které pro vás zafungují nejlépe.

source: Contact us
cs: Kontaktujte nás

source: Other Sponsorship Options
cs: Jiné možnosti sponzorství

source: PyLadies Chapter Sponsor
cs: Sponzor skupin PyLadies

source: $600 | Unlimited
cs: $600 | Bez limitů

source: Every year we have special short videos featuring different PyLadies Chapters around the world. The PyLadies Chapter Sponsor get to have the exclusive branding visibility on these videos during the intro and outro videocard. These videos will also remain on our official Youtube channel which means you will enjoy an evergreen branding visibility.
cs: Každý rok zveřejňujeme sérii krátkých videí o různých skupinách PyLadies z celého světa. Sponzor skupin PyLadies dostane exkluzivní příležitost umístit svůj branding v těchto videích na intro a outro panelech. Videa zůstanou navždy na našem oficiálním Youtube kanálu, což znamená nekonečný dosah vaší značky.

source: Prominent placement of logo and link on the website (all year round)
cs: Zveřejníme logo a odkaz na vaše webovky na prominentním místě (po celý rok)

source: Social media mentions
cs: Zmínky v social mediích

source: Logo visibility on opening and closing of every PyLadies Chapter
cs: Promítnutí loga na začátku a konci každé skupiny PyLadies

source: Custom Discord Role
cs: Vlastní role na Discordu

source: PyLadies Discussion Sponsor
cs: Sponzor PyLadies diskuzí

source: $600 | 6 slots
cs: $600 | 6 slotů

source: PyLadiesCon has 6 different panel discussions each year streaming live from different regions around the world. These panels are usually one of the most popular talks.
cs: PyLadiesCon obsahuje 6 panelových diskuzí na rozmanitá témata streamovaných z různých regionů světa. Tyto panely jsou naše nejoblíbenější druhy obsahu.

source: Logo visibility on opening and closing of every PyLadies Panel Discussions
cs: Promítnutí loga na začátku a konci každého diskuzního panelu PyLadiesCon

source: The Attendees
cs: Účastnictvo

source: The attendees of last year's conference represented companies and organizations from all sectors, and held the types of position on the right table.
cs: Účastnictvo loňské konference reprezentovalo firmy a organizace ze všech sektorů a zastávalo typy pracovních pozic zobrazené v tabulce vpravo.

source: Quick stats
cs: Statistiky

source: In 2023, we had more than 600 attendees,
cs: V 2023 jsme měli více než 600 účastníků a účastnic,

source: In 2024, we had 732 attendees
cs: V 2024, zúčastnilo se 732 lidí

source: Benefits of Sponsorship
cs: Výhody sponzorství

source: <strong>Targeted Audience</strong>: Reach out to a targeted market with those who could potentially become your employees. Find passionate Pythonistas to hire.
cs: <strong>Cílová skupina</strong>: Dostaňte se mezi svou cílovou skupinu a najděte vhodné kandidáty mezi plnými nadšení Pythonistkami a Pythonisty.

source: <strong>Branding</strong>: Increasing your brand exposure and elevating your corporate identity within the community.
cs: <strong>Dosah značky</strong>: Zvyšte dosah své značky a zvedněte povědomí o své firmě v naší komunitě.

source: <strong>Community Contribution</strong>: Contribute, support and sustain the underrepresented Python community.
cs: <strong>Podílení se na rozvoji komunity</strong>: Přidejte se, podpořte a pomozte růst méně reprezentované části Python komunity.

source: Current Position
cs: Aktuální pozice

source: Count
cs: Počet

source: Percentage
cs: Procento

source: Share, learn and contribute!
cs: Sdílejte, vzdělávejte se, zapojte se!
es: ¡Comparte, aprende y contribuye!
fr: Partager, apprener et collaborer !
pt: Partilha, aprende e contribui!

source: Sprints are informal coding sessions, and knowledge sharing where people gather together to work on Open-Source projects, suggest changes in existing libraries solve problems. A Sprint is an opportunity for learning and self-development while contributing to Open Source projects.
cs: Sprinty jsou neformální programovací setkání, na kterých skupina lidí společně pracuje na projektech Open Source, navrhuje změny v existujících knihovnách a řeší problémy. Sprint je příležitost naučit se něco nového, a zároveň přispět do projektů Open Source.
es: Los Sprints son sesiones informales de programación e intercambio de conocimientos donde las personas se reúnen para trabajar en proyectos de código abierto, sugerir cambios en las bibliotecas existentes y resolver problemas. Un Sprint es una oportunidad para el aprendizaje y el desarrollo personal, al mismo tiempo que se contribuye a proyectos de código abierto.
fr: Les sprints sont des sessions informelles de codage et de partage de connaissances où les gens se réunissent pour travailler sur des projets open source, suggérer des modifications aux bibliothèques existantes et résoudre des problèmes. Un sprint est une occasion d'apprendre et de se perfectionner tout en contribuant à des projets open source.
pt: Sprints são sessões informais de programação e partilha de conhecimento onde as pessoas se reúnem para trabalhar em projetos Open-Source, sugerir alterações em bibliotecas existentes e resolver problemas. Um Sprint é uma oportunidade para aprendizagem e auto-desenvolvimento enquanto contribuis para projetos Open Source.

source: We encourage maintainers to submit their projects by checking out our <a href="https://conference.pyladies.com/docs/speakers/sprints_guide/" class="text-pinkpyladies" target="_blank">sprints guide</a>.
cs: Prosíme maintainery o přihlášení svých projektů po zhlédnutí <a href="https://conference.pyladies.com/docs/speakers/sprints_guide/" class="text-pinkpyladies" target="_blank">průvodce sprinty</a>.
fr: Nous encourageons les responsables de maintenance à soumettre leurs projets en consultant notre guide des sprints <a href="https://conference.pyladies.com/docs/speakers/sprints_guide/" class="text-pinkpyladies" target="_blank">sprints guide</a>.

source: Sprints will run on Sunday, December 7th, from 08:00 to 23:59 UTC.
cs: Sprinty se budou konat v neděli 7. prosince, od 08:00 do 23:59 UTC.

source: -- No sprints added yet --
cs: -- Sprinty zatím nebyly přidány --
es: -- No se han agregado sprints aún --
fr: -- Aucun sprint disponible --
pt: -- Ainda não foram adicionados sprints --

source: Level:
cs: Úroveň:
es: Nivel:
fr: Niveau
pt: Nível:

source: Languages:
cs: Jazyky:
es: Lenguajes:
fr: Programmation
pt: Linguagens:

source: Thanks to all the volunteers for making this possible
cs: Děkujeme dobrovolnictvu, bez něhož by se tahle konference nemohla uskutečnit
fr: Merci à tous les volontaires d'avoir rendu ceci possible

source: Our Volunteers
cs: Naše dobrovolnictvo
es: Voluntariado

source: See All
cs: Zobrazit vše
fr: Voir tout

source: Group by Team
cs: Seskupit dle týmu
fr: Groupé par équipe

source: Open Spaces
es: Espacios Abiertos
fr: Développements participatifs
pt: Espaços Abertos

source: FAQ
es: Preguntas frecuentes

source: Code of Conduct
es: Código de Conducta
fr: Code de conduite
pt: Código de Conduta

source: Workshop
es: Taller
fr: Atelier

source: Blog
fr: Blogue

source: <code class="text-blue-400">#welcome</code>, for you to introduce yourself and say hi to others,
fr: <code class="text-blue-400">#welcome</code>, pour vous présenter et saluer les autres,

source: Panel
pt: Painel
