Repository: pyladies/global-conference-2025
Catalog: locales/*/messages.po
Languages: cs, es, fr, pt

source: Experience
cs: Zkušenosti
es: Experiencia
fr: Expérience
pt: Experiência

source: At PyLadiesCon, we’re bringing the Python world right to your screen. Make sure to mark your calendars for the first weekend of December as we embark on a two-day journey that promises to be unforgettable.
cs: PyLadiesCon přináší svět Pythonu přímo před vaši obrazovku. Uložte si první víkend prosince v kalendáři jako termín, kdy se společně vydáme na nezapomenutelné dvoudenní dobrodružství.
es: En PyLadiesCon, estamos trayendo el mundo de Python directamente a tu puerta. Asegúrate de marcar tu calendario para el segundo fin de semana de diciembre mientras nos embarcamos en un viaje de dos días que promete ser inolvidable.
fr: À PyLadiesCon, nous vous faisons découvrir l'univers Python exclusivement sur votre écran. N'oubliez pas de marquer vos agendas pour le prémier weekend du mois de décembre, où nous vous amenons avec nous pendant deux (02) jours qui promettent d'être inoubliables.
pt: Na PyLadiesCon, trazemos o mundo Python diretamente para o teu ecrã. Marca nos teus calendários o primeiro fim de semana de Dezembro, pois embarcaremos numa jornada de dois dias que promete ser inesquecível.

source: The Goal
cs: Cíl
es: El Objetivo
fr: L'objectif
pt: O Objetivo

source: This conference is designed to promote diversity, learning, and empowerment within the Python community. We enthusiastically welcome presenters from members and supporters of the PyLadies Community. Prior experience is not required. Everyone is welcome to share your insights and expertise.
cs: Konference propaguje diverzitu, vzdělání a empowerment v Pythonní komunitě. S radostí vítáme přednášející z řad členstva a podporovatelstva komunity PyLadies. Předchozí zkušeností nejsou nutné. Každá a každý jsou vítaní, aby se podělili o své zkušenosti a znalosti.
es: Esta conferencia está diseñada para promover la diversidad, el aprendizaje y el empoderamiento dentro de la comunidad de Python. Agradecemos con entusiasmo a quienes presentan y son parte de la comunidad de PyLadies. La experiencia previa es opcional para compartir tus ideas y vivencias.
fr: Cette conférence a pour but de promouvoir la diversité, l'apprentissage et l'autonomisation au sein de la communauté Python. C'est avec enthousiasme que nous accueillons les intervenants, les members et les sympathisants de la communauté PyLadies. Notez qu'aucune expérience préalable n'est réquise . Tout le monde est invité à partager ses idées et son expertise.
pt: Esta conferência foi desenhada para promover a diversidade, aprendizagem e empoderamento dentro da comunidade Python. Damos as boas-vindas a apresentadores membros e apoiantes da Comunidade PyLadies. Experiência prévia não é necessária. Todos são bem-vindos a partilhar os seus conhecimentos e experiência.

source: The Languages
cs: Jazyky
es: Los Lenguajes
fr: Les langages
pt: As Línguas

source: Given that we are a global community, we warmly invite talks in the following languages: English, Español, Português, Deutsch, 日本語 and 中文.
cs: Jsme globální komunita, a proto uvítáme přihlášky v následujících jazycích: English, Español, Português, Deutsch, 日本語 a 中文.
es: Dado que somos una comunidad global, invitamos calurosamente las conversaciones en los siguientes idiomas: Inglés, Español, Portugués, Alemán, Chino mandarín y Japonés.
fr: Etant donné que nous sommes une communauté mondiale, nous acceptons les talks et présentations dans les langues suivantes: anglais, espagnole, portuguais, allemand, japonais et chinois.
pt: Dado que somos uma comunidade global, convidamos calorosamente palestras nas seguintes línguas: Inglês, Espanhol, Português, Alemão, Japonês e Chinês.

source: Insightful Talks
cs: Podnětné přednášky
es: Charlas Reveladoras
fr: Présentations inspirantes
pt: Palestras Inspiradoras

source: Dive deep into Python's latest trends, best practices, and cutting-edge technologies with our inspiring speakers.
cs: Ponořte se do posledních trendů v Pythonu, nejlepší praxe, a nejnovějších technologií s našimi inspirativními přednášejícími.
es: Entérate de las últimas tendencias, mejores prácticas y tecnologías de vanguardia de Python con ponentes inspiradores.
fr: Plongez au cœur des dernières tendances de Python, des bonnes pratiques et des technologies de pointe avec nos intervenant.es inspirant.es.
pt: Mergulha nas últimas tendências de Python, melhores práticas e tecnologias de ponta com as nossas oradoras inspiradoras.

source: Engaging Panels
cs: Angažující panely
es: Paneles Interesantes
fr: Panels intéressants
pt: Painéis Envolventes

source: Join thought-provoking discussions on topics ranging from Python development to career growth and beyond.
cs: Přidejte se k inspirujícím diskuzím na témata od vývoje Pythonu po rozvoj kariéry a mnoho dalších.
es: Únate a las discusiones estimulantes sobre temas que van desde el desarrollo de Python hasta el crecimiento profesional y más allá.
fr: Participez à des discussions stimulantes sur des sujets allant du développement Python à l'évolution de carrière et bien plus encore.
pt: Junta-te a discussões estimulantes sobre tópicos que vão desde o desenvolvimento Python até ao crescimento de carreira e muito mais.

source: Sprints and Workshop
cs: Sprinty a workshopy
es: Sprints y Talleres
fr: Sprints et ateliers
pt: Sprints e Workshops

source: Learning hands-on or contributing to a project, you decide! Join the sprints and workshops.
cs: Praktická výuka nebo přidání se do projektu - rozhodnutí je na vás! Přidejte se ke sprintům a workshopům.
es: Aprender a la práctica o contribuir a un proyecto, ¡tú decides! Únete a los sprints y talleres.
fr: Apprenez de manière interactive ou contribuer aux projets, c'est vous qui decidez! Participez aux sprints et aux ateliers.
pt: Aprender na prática ou contribuir para um projeto, tu decides! Junta-te aos sprints e workshops.

source: Motivated during the event? Organize an open space for people to gather and discuss any topic!
cs: Náhlý přísun motivace? Zorganizujte open space pro skupinku a společně prodiskutujte téma, které vás zajímá!
es: ¿Tienes motivación durante el evento? ¡Organiza un espacio abierto para que las personas se reúnan y discutan cualquier tema!
fr: Vous vous sentez motivé.e pendant l'évènement? Organiser un espace de développement participatif pour rassembler les participants et discuter sur n'importe quel sujet!
pt: Motivado durante o evento? Organiza um espaço aberto para as pessoas se reunirem e discutirem qualquer tópico!

source: Collaborative Networking
cs: Spolupráce a networking
es: Redes Colaborativas
fr: Réseautage collaboratif
pt: Networking Colaborativo

source: Connect with fellow Python enthusiasts, expand your professional network, and forge new friendships.
cs: Seznamte se s dalšími fanoušky Pythonu, rozvíjejte svou profesionální síť a nastartujte nová přátelství.
es: Conéctate con personas entusiastas de Python, expande tu red profesional y forja nuevas amistades.
fr: Échangez avec d’autres passionné.e.s de Python, élargissez votre réseau et faites de nouvelles rencontres.
pt: Conecta-te com outros entusiastas de Python, expande a tua rede profissional e cria novas amizades.

source: Volunteer
cs: Dobrovolničení
es: Voluntariado
fr: Bénévoles
pt: Voluntariado

source: We would not be able to run this conference without help from our volunteers. Please check the Volunteer guide for more details on how to volunteer!
cs: Tato konference by nevznikla bez pomoci našeho dobrovolnictva. Podívejte se do Průvodce dobrovolnictva pro víc detailů, jak se můžete zapojit!
es: No podríamos organizar esta conferencia sin la ayuda del voluntariado. ¡Visita la página de voluntariado para obtener más detalles sobre cómo unirte!
fr: Nous ne pourrions pas organiser cette conférence sans l'aide de nos bénévoles. Veuillez consulter le guide des volontaires pour plus de détails sur la manière de devenir bénévole!
pt: Não conseguiríamos realizar esta conferência sem a ajuda dos nossos voluntários. Por favor, consulta o guia de Voluntariado para mais detalhes sobre como ser voluntário!

source: Conference Details
cs: Detaily konference
es: Detalles de la Conferencia
fr: Détails de la conférence
pt: Detalhes da Conferência

source: The Event
cs: Událost
es: El Evento
fr: L'évènement
pt: O Evento

source: PyLadies Conference (PyLadiesCon) is the third PyLadies conference held– an exciting online and FREE event dedicated to empowerment, learning, and diversity within the Python community! 🎉
cs: Konference PyLadies (PyLadiesCon) se koná už potřetí - jedná se o online konferenci ZDARMA věnovanou diverzitě, vzdělání a empowermentu v celé Python komunitě! 🎉
es: PyLadies Conference (PyLadiesCon) es la tercera conferencia de PyLadies celebrada, ¡un emocionante evento en línea y gratuito dedicado al empoderamiento, el aprendizaje y la diversidad dentro de la comunidad de Python! 🎉
fr: La conférence PyLadies (PyLadiesCon) est la troisième conférence organisée, un évènement passionnant en ligne et totalement GRATUIT, dédié à l'autonomisation, l'apprentissage, et la diversité au sein de la communauté Python ! 🎉
pt: A Conferência PyLadies (PyLadiesCon) é a terceira conferência PyLadies realizada – um evento online e GRATUITO dedicado ao empoderamento, aprendizagem e diversidade dentro da comunidade Python! 🎉

source: Learn more
cs: Dozvěte se víc
es: Obtén más información
fr: Lire plus
pt: Saber mais

source: Why an online event?
cs: Proč je konference online?
es: ¿Por qué un evento en línea?
fr: Pourquoi une conférence en ligne?
pt: Porquê um evento online?

source: We would love to have PyLadiesCon as a physical event, but that limits the amount of participants we can get around the world. We aim to reduce barriers in participating and create an inclusive environment for our community.
cs: Bylo by skvělé mít PyLadiesCon jako offline událost, ale v tom případě by se mnohé a mnozí přednášející nemohli zúčastnit. Chceme redukovat bariéry pro vstup a vytvářet prostředí, které je otevřeno pro veškeré členstvo naší komunity.
es: Nos encantaría tener PyLadiesCon como un evento en persona, pero eso limita la cantidad de participantes que podemos superar el mundo. Probar las transmisiones de un evento físico también podrían crear una barrera de los dos grupos diferentes de asistentes.
fr: Nous aimerions beaucoup que PyLadiesCon soit un événement physique, mais cela limiterait le nombre de participants que nous pouvons accueillir à travers le monde. Notre objectif est de réduire les freins à la participation et de créer un environnement inclusif pour notre communauté.
pt: Adoraríamos ter a PyLadiesCon como um evento físico, mas isso limita a quantidade de participantes que podemos ter de todo o mundo. O nosso objetivo é reduzir as barreiras à participação e criar um ambiente inclusivo para a nossa comunidade.

source: Why do you use Discord?
cs: Proč používáte Discord?
es: ¿Por qué usas Discord?
fr: Pourquoi utiliser Discord ?
pt: Porquê usar o Discord?

source: Having tried various other online event platforms, we are happy with Discord because not only that is affordable, but also offers enough capabilities for the conference to work.
cs: Vyzkoušeli jsme různé platformy pro správu online událostí a shodli jsme se na Discordu - nejen proto, že si ho můžeme finančně dovolit, ale taky má dostatečné technické možností pro naše potřeby.
es: Después de muchos años, la organización de la conferencia han participado en eventos que han utilizado muchas plataformas en línea, y han decidido que Discord es la única plataforma asequible y tiene suficientes capacidades para que la conferencia funcione.
fr: Après avoir essayé diverses autres plateformes d'événements en ligne, nous sommes satisfaits de Discord car non seulement elle est abordable, mais elle offre également suffisamment de fonctionnalités pour que la conférence réussisse.
pt: Tendo experimentado várias outras plataformas de eventos online, estamos satisfeitos com o Discord porque não só é acessível, como também oferece capacidades suficientes para a conferência funcionar.

source: There are no PyLadies groups in my city, can I still attend?
cs: V mém okolí nejsou žádné PyLadies, smím se zúčastnit i tak?
es: No hay grupos de PyLadies en mi ciudad, ¿puedo seguir asistiendo?
fr: Il n'y a pas de groupe PyLadies ou chapitre PyLadies dans ma ville, pourrais-je participer ?
pt: Não existem grupos PyLadies na minha cidade, posso participar?

source: Yes, everyone is welcome, independently if you belong to a chapter or no
cs: Ano, každá a každý jsou vítaní, nehledě na to, jestli patříte do existující komunity, nebo ne
es: Sí, todos son bienvenidos, independientemente si perteneces a un capítulo o no
fr: Oui, tout le monde est le bienvenu, que vous apparteniez ou non à un chapitre PyLadies
pt: Sim, todos são bem-vindos, independentemente de pertencerem a um capítulo ou não

source: My language is not within the conference languages, how can I include it?
cs: Můj jazyk není jazykem konference, jak ho můžu přidat?
es: Mi idioma no está dentro de los idiomas de la conferencia, ¿cómo puedo incluirlo?
fr: Ma langue ne fait pas partie des langues de la conférence, comment puis-je l'inclure ?
pt: A minha língua não está nas línguas da conferência, como posso incluí-la?

source: We would be happy to include your language, as long as there is a group of volunteers that can take care of reviewing proposals, generating and verifying subtitles, host talks, and translate the content in our platforms.
cs: Rádi přidáme váš jazyk, pokud se najde skupina dobrovolnictva, které se postará o vyhodnocení přihlášek, vytvoření a verifikaci titulků, moderaci přednášek a překlad obsahu našich platforem.
es: Estaríamos encantados de incluir su idioma, siempre que haya un grupo de voluntarios que puedan encargarse de revisar propuestas, generar y verificar subtítulos, charlas de anfitriones y traducir el contenido en nuestras plataformas.
fr: Nous serions ravis d'inclure votre langue, à condition qu'il existe un groupe de volontaires capables de réviser les propositions de talk, de créer et de vérifier les sous-titres, d'animer des discussions et de traduire le contenu de nos plateformes.
pt: Ficaríamos felizes em incluir a tua língua, desde que haja um grupo de voluntários que possa tratar da revisão de propostas, gerar e verificar legendas, apresentar palestras e traduzir o conteúdo nas nossas plataformas.

source: I don't know Python, but I'm interested into learning, should I join?
cs: Neumím Python, ale chci se naučit. Můžu se přidat?
es: No conozco Python, pero tengo interés en aprender, ¿debería unirme?
fr: Je ne connais pas Python, mais j'aimerais apprendre. Pourrais-je participer ?
pt: Não sei Python, mas tenho interesse em aprender, devo participar?

source: Some topics might be difficult to understand, but we aim to have talks from many levels, including beginner topics, and also some activities for people to learn.
cs: Některá témata můžou být složitá na pochopení, ale máme přednášky na mnoha úrovních, včetně začátečnické, a taky plánujeme vzdělávací aktivity.
es: Algunos temas pueden ser difíciles de entender, pero nuestro objetivo es tener conversaciones desde muchos niveles, incluidos los temas para principiantes, y también algunas actividades para que las personas aprendan.
fr: Certains thèmes peuvent être difficiles à comprendre, mais nous proposons des sujets de différents niveaux, y compris des sujets pour débutants ou novice, ainsi que des activités permettant aux participants d'apprendre.
pt: Alguns tópicos podem ser difíceis de entender, mas pretendemos ter palestras de vários níveis, incluindo tópicos para iniciantes, e também algumas atividades para as pessoas aprenderem.

source: Do you need help with the conference?
cs: Potřebujete pomoct s konferencí?
es: ¿Necesitas ayuda con la conferencia?
fr: Avez-vous besoin d'aide pour la conférence ?
pt: Precisam de ajuda com a conferência?

source: Yes!, we are usually looking for volunteers that can help us in tasks like reviewing proposals, generate and check subtitles, moderate sprints/workshops/panels, moderate discord, help us with the website, and many other things.
cs: Ano!, obvykle hledáme dobrovolnictvo, které nám pomůže s úkoly jako vyhodnocení přihlášek, tvorba a verifikace titulků, moderace sprintů, panelů a workshopů, moderace Discordu, pomoc s webovkou a mnoho dalších.
es: ¡Sí!, Generalmente estamos buscando voluntarios que puedan ayudarnos en tareas como revisar propuestas, generar y verificar subtítulos, sprints/talleres/paneles moderados, discordia moderada, ayudarnos con el sitio web y muchas otras cosas.
fr: Oui ! Nous recherchons généralement des volontaires qui peuvent nous aider dans des tâches telles que examiner les propositions, générer et vérifier les sous-titres, modérer les sprints/ateliers/panels, modérer Discord, nous aider avec le site web, et bien d'autres choses encore.
pt: Sim!, geralmente procuramos voluntários que nos possam ajudar em tarefas como rever propostas, gerar e verificar legendas, moderar sprints/workshops/painéis, moderar o discord, ajudar-nos com o site e muitas outras coisas.

source: Frequently Asked Questions
cs: Často kladené otázky (FAQ)
es: Preguntas frecuentes
fr: Foire aux questions
pt: Perguntas Frequentes

source: Home
cs: Domovská stránka

source: Copyright © PyLadiesCon 2025 - Present. All rights reserved
cs: Copyright © PyLadiesCon 2025 - Present. Všechna práva vyhrazena

source: 5th-7th December | Multi-language | Multi-timezone
cs: 5.-7. prosince | Mnohojazyčná | V mnoha časových zonách
es: Diciembre 5-7 | Multi-idioma | Multi-zona horaria
fr: Du 5 au 7 décembre | Multilingue | Multi-fuseaux horaires
pt: 5-7 de Dezembro | Multilíngue | Multi-fuso horário

source: Schedule
cs: Rozvrh
es: Programa
fr: Programme
pt: Horário

source: Register
cs: Zaregistrujte se
es: Registrarse
fr: S'inscrire
pt: Registar

source: Donate
cs: Přispějte
es: Donar
fr: Faire un don
pt: Doar

source: Visit our meta website
cs: Podívejte se na naši organizátorskou stránku
es: Ir a la versión base
fr: Visitez notre site web
pt: Visita o nosso site meta

source: The online conference of the PyLadies communities around the globe.
cs: Online konference komunit PyLadies z celého světa.
es: La conferencia en línea de las comunidades de PyLadies en todo el mundo.
fr: La conférence en ligne des communautés PyLadies à travers le monde entier.
pt: A conferência online das comunidades PyLadies de todo o mundo.

source: About the job:
cs: O pracovní pozici:

source: Read more
cs: Dozvěte se víc

source: Contact
cs: Kontaktní informace

source: Meet Our Keynotes
cs: Seznamte se s našimi hlavními řečnicemi
es: Conoce nuestras ponencias principales
fr: Decouvrez nos principaux conférenciers (Keynotes)
pt: Conhece os nossos Keynotes

source: Keynotes
cs: Hlavni řečnice
es: Ponencias Principales

source: Mariatta is a Python core developer where she focuses on improving the workflow and documentation. She is active in the Python community as an advisor for the Global PyLadies, and PyCon US Chair.
cs: Mariatta je Python core vývojářka, kde se soustředí na vylepšení workflow a dokumentace. Je aktivní v Python komunitě jako poradkyně globálních PyLadies a předsedkyně PyCon US.
es: Mariatta es una desarrolladora principal de Python donde se enfoca en mejorar el flujo de trabajo y la documentación. Ella es activa en la comunidad de Python como asesora de PyLadies Global y la directora de PyCon.
fr: Mariatta est développeuse core Python, où elle se concentre sur l'amélioration des workflows et de la documentation. Elle est active dans la communauté Python en tant que conseillère pour Global PyLadies et présidente de PyCon US.
pt: A Mariatta é uma developer de Python core que se dedica a melhorar o fluxo de trabalho e a documentação. Ela é ativa na comunidade Python como conselheira para a Global PyLadies e presidente da PyCon US.

source: I am a passionate biotechnologist, working as a Sr. Data Scientist in Berlin. In my spare time, I love to develop projects that can help people around our own planet, help to organize workshops and give talks in many python communities.
cs: Jsem angažovaná biotechnoložka pracující jako Sr. Data Scientist v Berlíně. Ve volném čase vyvíjím projekty pomáhající lidem na celé planetě, organizuji workshopy a přednáším na Pythonních konferencích.
es: Biotecnóloga apasionada, trabajando como Científica de datos Senior en Berlín. En mi tiempo libre, me encanta desarrollar proyectos que puedan ayudar a las personas alrededor de nuestro propio planeta, ayudar a organizar talleres y dar charlas en muchas comunidades de Python.
fr: Je suis un biotechnologiste passionnée, travaillant comme Data Scientist senior à Berlin. Pendant mon temps libre, j'aime développer des projets qui peuvent aider les gens à travers notre planète, aider à organiser des ateliers et donner des conférences dans de nombreuses communautés Python.
pt: Sou uma biotecnóloga apaixonada, a trabalhar como Senior Data Scientist em Berlim. No meu tempo livre, adoro desenvolver projetos que possam ajudar pessoas em todo o nosso planeta, ajudar a organizar workshops e dar palestras em muitas comunidades Python.

source: Software QA Analyst. Python community manager. Python Software Foundation (PSF) Fellow & Director. Advocates diversity and inclusion within tech communities. PyLadies chapters organizer.
cs: Software QA Analyst. Manažerka Python komunity. Python Software Foundation (PSF) Fellow & Director. Zasazuje se o diverzitu a inkluzi v technologických komunitách. Organizátorka PyLadies.
es: Software Analista de control de calidad. Python Community Manager. Python Software Foundation (PSF) Fellow & Director. Defiende la diversidad y la inclusión en las comunidades tecnológicas. Organizadora de capítulos de PyLadies.
fr: Analyste Qualité Assurance. Gestionnaire de communauté Python. Membre boursière et Directrice de la Python Software Foundation (PSF). Défenseure de la diversité et de l'inclusion au sein des communautés tech. Organisatrice des chapitres PyLadies.
pt: Analista de QA de Software. Gestora de comunidade Python. Fellow e Diretora da Python Software Foundation (PSF). Defensora da diversidade e inclusão nas comunidades tecnológicas. Organizadora de capítulos PyLadies.

source: Mother of 2 adults | Director @PSF | Fellow Member | 2020 PSF community service award | PSF D&I Workgroup Chair | PyCon US Design Lead since 2022
cs: Matka 2 dospelých | Director @PSF | Fellow Member | 2020 PSF community service award | PSF D&I Workgroup Chair | PyCon US Design Lead od 2022
es: Madre de 2 adultos | Directora @PSF | Fellow @PSF | Premio de servicio comunitario 2020 PSF | Directora del grupo de trabajo PSF D&I | Líder de diseño en PyCon US desde 2022
fr: Maman de deux adultes | Directrice @PSF | Membre boursière | Lauréate du prix Community Service en 2020 | Présidente de groupe de diversité et inclusion à PSF | Lead designeur de PyCon US depuis 2022
pt: Mãe de 2 adultos | Diretora @PSF | Membro Fellow | Prémio de serviço comunitário PSF 2020 | Presidente do Grupo de Trabalho D&I da PSF | Líder de Design da PyCon US desde 2022
