Repository: pyladies/global-conference-2025
Catalog: locales/*/messages.po
Languages: cs, es, fr, pt

source: <span class="font-medium"><b>Note:</b></span> In case you already have a Discord account, you don't need to create a new one.
cs: <span class="font-medium"><b>Pozor:</b></span> Pokud už máte účet na Discordu, nepotřebujete vytvářet nový.
es: <span class="font-medium"><b>Nota:</b></span> En caso que ya tengas una cuenta en Discord, no necesitas crear una nueva.
fr: <span class="font-medium"><b>Remarque:</b></span> Si vous possédez déjà un compte Discord, vous n'avez pas besoin d'en créer un nouveau.
pt: <span class="font-medium"><b>Nota:</b></span> Caso já tenhas uma conta Discord, não precisas de criar uma nova.

source: You will receive an invite link before the conference, but in case you want to join before, use this one:
cs: Před konferencí obdržíte odkaz s pozvánkou, ale pokud se chcete přidat dřív, použijte tento:
es: Recibirás un enlace de invitación en tu email, pero en caso que quieras unirte antes, usa éste:
fr: Vous recevrez un lien d'invitation avant la conférence, mais si vous souhaitez vous connecter avant, utilisez celui-ci :
pt: Receberás um link de convite antes da conferência, mas caso queiras juntar-te antes, usa este:

source: Once inside the server, head to the <code class="text-blue-400">#registration-form</code> channel, click on the <button type="button" class="focus:outline-none text-white bg-green-700 hover:bg-green-800 focus:ring-4 focus:ring-green-300 font-medium rounded-lg text-sm px-3 py-2 dark:bg-green-600 dark:hover:bg-green-700 dark:focus:ring-green-800">Register here 👈</button> button and a modal window will open, where you will need to enter your <b>Name</b> and <b>Ticket number</b>.
cs: Po otevření serveru, klikněte na <code class="text-blue-400">#registration-form</code>, pak na odkaz <button type="button" class="focus:outline-none text-white bg-green-700 hover:bg-green-800 focus:ring-4 focus:ring-green-300 font-medium rounded-lg text-sm px-3 py-2 dark:bg-green-600 dark:hover:bg-green-700 dark:focus:ring-green-800">Register here 👈</button>, co otevře okno, do kterého napište své <b>Jméno</b> a <b>Číslo objednávky</b>.
es: Una vez dentro del servidor, dirígete al canal <code class="text-blue-400">#registration-form</code>, haz clic en el botón <button type="button" class="focus:outline-none text-white bg-green-700 hover:bg-green-800 focus:ring-4 focus:ring-green-300 font-medium rounded-lg text-sm px-3 py-2 dark:bg-green-600 dark:hover:bg-green-700 dark:focus:ring-green-800">Register here 👈</button> y se abrirá una ventana modal donde deberás ingresar tu <b>Nombre</b> y <b>Número de entrada</b>.
fr: Une fois dans le serveur Discord, rendez-vous dans le canal <code class="text-blue-400">#registration-form</code> cliquez sur le bouton <button type="button" class="focus:outline-none text-white bg-green-700 hover:bg-green-800 focus:ring-4 focus:ring-green-300 font-medium rounded-lg text-sm px-3 py-2 dark:bg-green-600 dark:hover:bg-green-700 dark:focus:ring-green-800">Inscrivez-vous ici 👈</button> et une fenêtre modale s'ouvrira, dans laquelle vous devrez saisir votre <b>Nom</b> et votre <b>Numéro de ticket</b>.
pt: Uma vez dentro do servidor, dirige-te ao canal <code class="text-blue-400">#registration-form</code>, clica no botão <button type="button" class="focus:outline-none text-white bg-green-700 hover:bg-green-800 focus:ring-4 focus:ring-green-300 font-medium rounded-lg text-sm px-3 py-2 dark:bg-green-600 dark:hover:bg-green-700 dark:focus:ring-green-800">Regista-te aqui 👈</button> e uma janela modal abrir-se-á, onde precisarás de introduzir o teu <b>Nome</b> e <b>Número do bilhete</b>.

source: You need to enter <b>the exact</b> information from your conference ticket, that you received via email with a subject:<br><code class="text-gray-300">[PyLadiesCon 2025] Your order: XXXXX</code>, when you acquired the ticket.
cs: Musíte napsat <b>tu stejnou</b> informaci, jako je na vašem lístku, který jste obdrželi mailem s předmětem <br><code class="text-gray-300">[PyLadiesCon 2025] Your order: XXXXX</code>.
es: Debes ingresar <b>la información exacta</b> de tu entrada para la conferencia, la cual recibiste por correo electrónico con el asunto:<br><code class="text-gray-300">[PyLadiesCon 2025] Your order: XXXXX</code>, cuando adquiriste la entrada.
fr: Vous devez saisir les informations <b>exactes</b> figurant sur le ticket de la conference, que vous avez reçu par e-mail avec pour objet:<br><code class="text-gray-300">[PyLadiesCon 2025] Your order: XXXXX</code>, lorsque vous avez acheté le ticket.
pt: Precisas de introduzir a informação <b>exata</b> do teu bilhete da conferência, que recebeste via email com o assunto:<br><code class="text-gray-300">[PyLadiesCon 2025] Your order: XXXXX</code>, quando adquiriste o bilhete.

source: Joining as an Participant
cs: Jsem účastnictvo
es: Únete como Participante
fr: S'inscrire en tant que participant
pt: Participar como Participante

source: If this is your first PyLadiesCon, you should join Discord with the link that it will be sent to you a week before the conference.
cs: Pokud je to váš první PyLadiesCon, přidejte se do Discordu pomocí odkazu, který vám zašleme zhruba týden před konferencí.
es: Si esta es tu primera PyLadiesCon, debes unirte a Discord con el enlace que se te enviará una semana antes de la conferencia.
fr: Si c'est votre première PyLadiesCon, vous devriez rejoindre Discord en utilisant le lien qui vous sera envoyé une semaine avant la conférence.
pt: Se esta é a tua primeira PyLadiesCon, deves juntar-te ao Discord com o link que te será enviado uma semana antes da conferência.

source: Once you register successfully, you will get assigned the <code class="text-yellow-400">Participant</code> role.
cs: Po úspěšné registraci dostanete roli <code class="text-yellow-400">Participant</code>.
es: Una vez que te registres correctamente, se te asignará el rol de <code class="text-yellow-400">Participante</code>.
fr: Une fois votre inscription validée, vous obtiendrez le rôle de <code class="text-yellow-400">Participant</code>
pt: Assim que te registares com sucesso, ser-te-á atribuída a função <code class="text-yellow-400">Participant</code>.

source: Joining as a Sponsor
cs: Jsem sponzor
es: Únete como Patrocinante
fr: Devenir sponsor
pt: Participar como Patrocinador

source: If you are from a company that is <b>sponsoring the conference</b>, and you will participate in the many activities like Panel Discussion, Speed Interview, sharing information in your company's channel, you need to get a ticket with the <b>Voucher</b> that it will be sent to you, through the contact person at your company.
cs: Pokud jste z firmy <b>sponzorující konferenci</b> a zúčastníte se aktivit jako jsou diskuzní panel, rychlý pohovor nebo sdílení informací o firmě na kanále firmy, zaregistrujte vstupenku pomoci <b>Voucheru</b>, který vám zašle kontaktní osoba z firmy.
es: Si pertenece a una empresa que patrocina la conferencia y participará en las diversas actividades, como mesas redondas, entrevistas rápidas y compartirá información en el canal de su empresa, necesita obtener una entrada con el <b>código de descuento</b> que se le enviará a través de la persona de contacto de su empresa.
fr: Si vous travaillez pour une entreprise qui <b>sponsorise la conférence</b>, et que vous participerez à de nombreuses activités telles que des panels, des entretiens rapides ou de parler de votre entreprise, vous devez obtenir un ticket de <b>Voucher</b> qui vous sera envoyé par l'intermédiaire de la personne de contact de votre entreprise.
pt: Se és de uma empresa que está a <b>patrocinar a conferência</b>, e vais participar nas muitas atividades como Discussão em Painel, Entrevista Rápida, partilhar informações no canal da tua empresa, precisas de obter um bilhete com o <b>Voucher</b> que te será enviado, através da pessoa de contacto na tua empresa.

source: This is very important for you to get the <code class="text-yellow-400">Sponsor</code> role.
cs: Tohle je velmi důležité pro získání role <code class="text-yellow-400">Sponsor</code>.
es: Esto es muy importante para que obtenga el rol de <code class="text-yellow-400">Patrocinador</code>.
fr: C'est très important pour vous d'obtenir le rôle de <code class="text-yellow-400">Sponsor</code>.
pt: Isto é muito importante para obteres a função <code class="text-yellow-400">Sponsor</code>.

source: Joining as a Speaker
cs: Jsem přednášející
es: Únete como Ponente
fr: Devenir conférencier
pt: Participar como Oradora

source: If you have a confirmed Talk, Panel, or Keynote you should get a ticket using the Voucher that we will send you via email. The reason behind this is to automatically assign you the <code class="text-yellow-400">Speaker</code> role.
cs: Pokud máte potvrzenou přednášku, panel nebo hlavní přednášku, obdržíte vstupenku díky Voucheru, který vám pošleme mailem. Díky tomu se vám automaticky přiřadí role <code class="text-yellow-400">Speaker</code>.
es: Si tienes una charla, mesa redonda o ponencia confirmada, debes obtener tu entrada utilizando el código de descuento que te enviaremos por correo electrónico. El motivo es para asignarte automáticamente el rol de <code class="text-yellow-400">Ponente</code>.
fr: Si vous avez une conférence, un panel ou un discours confirmé, vous devez recevoir un billet (ticket) en utilisant le code coupon que nous vous enverrons par e-mail. La raison derrière cela est de vous attribuer automatiquement le rôle de <code class="text-yellow-400">Speaker</code>.
pt: Se tens uma Palestra, Painel ou Keynote confirmada, deves obter um bilhete usando o Voucher que te enviaremos via email. A razão por trás disto é atribuir-te automaticamente a função <code class="text-yellow-400">Speaker</code>.

source: Joining as a Volunteer
cs: Jsem dobrovolnictvo
es: Únete al Voluntariado
fr: Devenir bénévole
pt: Participar como Voluntário

source: If you are a conference Volunteer, it's highly probable you are already inside the server, but you <span class="text-red-500">will not</span> have access to the conference channels as long as you don't get a conference ticket, and do the registration process described at the top of this page.
cs: Pokud dobrovolničíte na konferenci, pravděpodobně už máte přístup na server, ale <span class="text-red-500">nedostanete</span> přístup do kanálů konference, dokud se nezaregistrujete jako účastnictvo, pomocí postupu popsaného výše na stránce.
es: Si eres voluntario de la conferencia, es muy probable que ya estés dentro del servidor, pero <span class="text-red-500">no tendrás</span> acceso a los canales de la conferencia a menos que obtengas una entrada para la conferencia y completes el proceso de registro descrito al principio de esta página.
fr: Si vous êtes bénévole pour la conférence, il est fort probable que vous soyez déjà connecté.e au serveur, mais vous <span class="text-red-500">n'aurez pas</span> accès aux canaux de la conférence tant que vous n'aurez pas obtenu un billet pour la conférence et effectué la procédure d'inscription décrite en haut de cette page.
pt: Se és um Voluntário da conferência, é muito provável que já estejas dentro do servidor, mas <span class="text-red-500">não terás</span> acesso aos canais da conferência enquanto não obtiveres um bilhete da conferência, e fizeres o processo de registo descrito no topo desta página.

source: If by some reason you haven't been assigned the <code class="text-yellow-400">Volunteer</code> contact the organization in the <code class="text-blue-400">#volunteers-general</code> channel.
cs: Pokud nemáte na sobě roli <code class="text-yellow-400">Volunteer</code>, kontaktujte organizátorstvo v kanálu <code class="text-blue-400">#volunteers-general</code>.
es: Si por alguna razón no se te ha asignado el rol de <code class="text-yellow-400">Voluntario</code>, contacta con la organización en el canal <code class="text-blue-400">#volunteers-general</code>.
fr: Si, pour une raison quelconque, vous n'avez pas été affecté au rôle <code class="text-yellow-400">Volunteer</code> contactez l'équipe organisatrice dans le canal <code class="text-blue-400">#volunteers-general</code>.
pt: Se por alguma razão não te tiver sido atribuída a função <code class="text-yellow-400">Volunteer</code> contacta a organização no canal <code class="text-blue-400">#volunteers-general</code>.

source: The server structure
cs: Struktura serveru
es: La estructura del servidor
fr: La structure su serveur Discord
pt: A estrutura do servidor

source: Once you join the server, you will see two categories, one called <b>Conference Information</b> with two channels:
cs: Po přidání se na server uvidíte dvě kategorie, jednu pojmenovanou <b>Conference Information</b> se dvěma kanály:
es: Una vez que te unas al servidor, verás dos categorías, una llamada <b>Información de la Conferencia</b> con dos canales:
fr: Une fois connecté.e au serveur Discord, vous verrez deux catégories, l'une intitulée <b>Conference Information</b> avec deux canaux:
pt: Assim que entrares no servidor, verás duas categorias, uma chamada <b>Conference Information</b> com dois canais:

source: a text channel called <code class="text-blue-400">#rules</code>, with the rules of the server, and
cs: textový kanál <code class="text-blue-400">#rules</code> s pravidly serveru, a
es: un canal de texto llamado <code class="text-blue-400">#rules</code>, con las reglas del servidor, y
fr: un canal de discussion appelé <code class="text-blue-400">#rules</code>, contenant lesrègles du serveur, et
pt: um canal de texto chamado <code class="text-blue-400">#rules</code>, com as regras do servidor, e

source: a text channel called <code class="text-blue-400">#code-of-conduct</code>, with the guidelines to participate in the event
cs: textový kanál <code class="text-blue-400">#code-of-conduct</code> s pravidly účasti v konferenci
es: un canal de texto llamado <code class="text-blue-400">#code-of-conduct</code>, con las directrices para participar en el evento
fr: un canal de discussion nommé <code class="text-blue-400">#code-of-conduct</code>, contenant les directives pour participer à l'évènement
pt: um canal de texto chamado <code class="text-blue-400">#code-of-conduct</code>, com as diretrizes para participar no evento

source: Another category called <b>Registration</b> with two channels:
cs: Druha kategorie je <b>Registration</b> se dvěma kanály:
es: Otra categoría llamada <b>Registro</b> con dos canales:
fr: Un autre rôle appelé <b>Registration</b> avec deux canaux de discussion:
pt: Outra categoria chamada <b>Registration</b> com dois canais:

source: a text channel called <code class="text-blue-400">#registration-form</code> where you can see the button to register, and
cs: textový kanál <code class="text-blue-400">#registration-form</code>, kde najdete odkaz k registraci
es: un canal de texto llamado <code class="text-blue-400">#registration-form</code> donde puedes ver el botón para registrarte, y
fr: un canal de discussion nommé <code class="text-blue-400">#registration-form</code> où vous pouvez voir le bouton pour vous inscrire, et
pt: um canal de texto chamado <code class="text-blue-400">#registration-form</code> onde podes ver o botão para te registares, e

source: a forum channel called <code class="text-blue-400">💬registration-help</code>, where you can ask any question regarding the registration process.
cs: fórum pojmenované <code class="text-blue-400">💬registration-help</code>, kde se můžete ptát na proces registrace.
es: un canal de foro llamado <code class="text-blue-400">💬registration-help</code>, donde puedes hacer cualquier pregunta sobre el proceso de registro.
fr: un canal du discord nommé <code class="text-blue-400">💬registration-help</code>, où vous pouvez poser toutes vos questions concernant le processus d'inscription.
pt: um canal de fórum chamado <code class="text-blue-400">💬registration-help</code>, onde podes fazer qualquer pergunta sobre o processo de registo.

source: If you have any question after you registered, you can leave your question in the <code class="text-blue-400">💬help</code> forum.
cs: Pokud máte otázky po registraci, ptejte se na fóru <code class="text-blue-400">💬help</code>.
es: Si tiene alguna pregunta después de registrarse, puede dejarla en el foro de <code class="text-blue-400">💬ayuda</code>.
fr: Si vous avez des questions après votre inscription, vous pouvez les poser dans le Discord <code class="text-blue-400">💬help</code>.
pt: Se tiveres alguma dúvida depois de te registares, podes deixar a tua pergunta no fórum <code class="text-blue-400">💬help</code>.

source: Get the latest updates
cs: Nepropásněte žádně novinky
es: Obtén las últimas actualizaciones
fr: Recevez les dernières mises à jour
pt: Recebe as últimas atualizações

source: Once registered, the <b>Conference Information</b> will contains more channels:
cs: Po registraci <b>Conference Information</b> se rozšíří o další kanály:
es: Una vez registrado, la sección de <b>Información de la Conferencia</b> contendrá más canales:
fr: Une fois inscrit.e, la rubrique <b>Conference Information</b> contiendra plus de canaux :
pt: Uma vez registado, a <b>Conference Information</b> conterá mais canais:

source: <code class="text-blue-400">#announcements</code>, to get the general conference announcements,
cs: <code class="text-blue-400">#announcements</code> pro obecné konferenční oznámení,
es: <code class="text-blue-400">#announcements</code>, para recibir los anuncios generales de la conferencia,
fr: <code class="text-blue-400">#announcements</code>, pour recevoir les annonces générales de la conférence,
pt: <code class="text-blue-400">#announcements</code>, para obter os anúncios gerais da conferência,

source: <code class="text-blue-400">#outreach-social-media</code>, to get the conference posts on social media, so you can share them,
cs: <code class="text-blue-400">#outreach-social-media</code>, kde najdete připravené posty na social media, které můžete sdílet,
es: <code class="text-blue-400">#outreach-social-media</code>, para obtener las publicaciones de la conferencia en las redes sociales y poder compartirlas,
fr: <code class="text-blue-400">#outreach-social-media</code>, pour les voir les publications de la conférence sur les réseaux sociaux, pour que vous puissiez les partager à votre tour,
pt: <code class="text-blue-400">#outreach-social-media</code>, para obter as publicações da conferência nas redes sociais, para que as possas partilhar,

source: <code class="text-blue-400">#donations</code>, to track the donations through <a href="https://pretix.eu/pyladiescon/2025">Pretix</a> during the conference,
cs: <code class="text-blue-400">#donations</code>, pro sledování dotací na <a href="https://pretix.eu/pyladiescon/2025">Pretixu</a> během konference,
es: <code class="text-blue-400">#donations</code>, para realizar un seguimiento de las donaciones a través de <a href="https://pretix.eu/pyladiescon/2025">Pretix</a> durante la conferencia,
fr: <code class="text-blue-400">#donations</code>, pour suivre les dons via <a href="https://pretix.eu/pyladiescon/2025">Pretix</a> pendant la conférence,
pt: <code class="text-blue-400">#donations</code>, para acompanhar as doações através do <a href="https://pretix.eu/pyladiescon/2025">Pretix</a> durante a conferência,

source: <code class="text-blue-400">#session-notifications</code>, to know the upcoming talks and events,
cs: <code class="text-blue-400">#session-notifications</code> pro upozornění na nejbližší přednášky a události,
es: <code class="text-blue-400">#session-notifications</code>, para conocer las próximas charlas y eventos,
fr: <code class="text-blue-400">#session-notifications</code>, our connaître les conférences et événements à venir
pt: <code class="text-blue-400">#session-notifications</code>, para saber as próximas palestras e eventos,

source: <code class="text-blue-400">#global-events</code>, to discover events happening in the rest of the world.
cs: <code class="text-blue-400">#global-events</code>, pro nalezení akcí konaných v jiných částech světa.
es: <code class="text-blue-400">#global-events</code>, para descubrir eventos que se celebran en el resto del mundo.
fr: <code class="text-blue-400">#global-events</code>, pour découvrir les événements qui se déroulent dans le reste du monde.
pt: <code class="text-blue-400">#global-events</code>, para descobrir eventos a acontecer no resto do mundo.

source: Interact with others
cs: Bavte se s ostatními
es: Interactuar con otras personas
fr: Interagir avec les autres
pt: Interage com outros

source: The <b>Conference</b> category will be visible once you register, and will contain the following channels:
cs: Kategorie <b>Conference</b> se zobrazí po registraci, a bude obsahovat následující:
es: La categoría <b>Conferencia</b> será visible una vez que te registres y contendrá los siguientes canales:
fr: Le rôle de la <b>conférence</b> sera visible une fois que vous vous serez inscrit.e et contiendra les salons(canaux) suivants:
pt: A categoria <b>Conference</b> ficará visível assim que te registares, e conterá os seguintes canais:

source: <code class="text-blue-400">#introductions</code>, for you to introduce yourself and say hi to others,
cs: <code class="text-blue-400">#introductions</code> pro představení a přivítání se s ostatními,
es: <code class="text-blue-400">#introductions</code>, para presentarte y saludar a los demás,
pt: <code class="text-blue-400">#introductions</code>, para te apresentares e dizeres olá aos outros,

source: <code class="text-blue-400">#general</code>, for a general conference discussion,
cs: <code class="text-blue-400">#general</code>, pro obecnou diskuzi,
es: <code class="text-blue-400">#general</code>, para una discusión general sobre la conferencia,
fr: <code class="text-blue-400">#general</code>, pour les discussions générales liées à la conférence,
pt: <code class="text-blue-400">#general</code>, para uma discussão geral sobre a conferência,

source: <code class="text-blue-400">#networking</code>, so you can share your social media to connect with others,
cs: <code class="text-blue-400">#networking</code> pro sdílení profilů v social mediích,
es: <code class="text-blue-400">#networking</code>, para que puedas compartir tus redes sociales y conectar con otros,
fr: <code class="text-blue-400">#networking</code>, afin que vous puissiez partager vos réseaux sociaux pour se connecter avec les autres,
pt: <code class="text-blue-400">#networking</code>, para partilhares as tuas redes sociais e conectares-te com outros,

source: <code class="text-blue-400">#random</code>, for any discussion not related to the conference,
cs: <code class="text-blue-400">#random</code> pro diskuse nesouvisející s konferencí,
es: <code class="text-blue-400">#random</code>, para cualquier discusión no relacionada con la conferencia,
fr: <code class="text-blue-400">#random</code>, pour toute discussion liée à la conférence,
pt: <code class="text-blue-400">#random</code>, para qualquer discussão não relacionada com a conferência,

source: <code class="text-blue-400">#job-board</code>, in case you are looking for job offers,
cs: <code class="text-blue-400">#job-board</code>, pokud hledáš práci,
es: <code class="text-blue-400">#job-board</code>, por si buscas ofertas de trabajo,
fr: <code class="text-blue-400">#job-board</code>, si vous recherchez des offres d'emploi,
pt: <code class="text-blue-400">#job-board</code>, caso estejas à procura de oportunidades de emprego,
