Repository: pyladies/global-conference-2025
Catalog: locales/*/messages.po
Languages: cs, es, fr, pt

source: Contributor and community member in the African Python Software Community and has served as an organizer for local and international community events. She is a Fellow and a Community Service award winner at the PSF.
cs: Spolutvůrkyně a členka africké Python komunity, organizovala rozmanité lokální a mezinárodní akce. Je PSF Fellow a vítězkou Community Service award udělovanou PSF.
es: Colaboradora y parte de la comunidad de Python Africa y ha servido como organizadora de eventos comunitarios locales e internacionales. Obtuvo el premio de servicio comunitario en la PSF.
fr: Contributrice et membre de la communauté Python Software Community en Afrique. Elle a également organisé des événements communautaires locaux et internationaux. Elle est membre et lauréate du prix Community Service de la PSF.
pt: Contribuidora e membro da comunidade na Comunidade de Software Python Africana e serviu como organizadora de eventos comunitários locais e internacionais. Ela é Fellow e vencedora do prémio de Serviço Comunitário na PSF.

source: Python community and conference serial organizer, contributing to many Open Source initiatives. He is a PSF Board Director and Fellow. He is currently working at The Qt Company.
cs: Sériový komunitní a konferenční organizátor, člen mnoha iniciativ Open Source. Je PSF Board Director a Fellow. Aktuálně pracuje pro The Qt Company.
es: Organizador serial de comunidades y conferencias Pythonzer, que contribuye a muchas iniciativas Open Source. Él es un director la junta de la PSF y también un PSF Fellow. Actualmente, él trabaja en The Qt Company.
fr: Gestionnaire de communauté Python et organisateur d'évènement à plusieurs reprise, il contribue à de nombreuses initiatives. Il est membre du conseil d'administration et membre boursier de la PSF. Il travail actuellement chez The Qt Company.

source: An Irish Pythonista advocating diversity in tech, and runs regular PyLadies Dublin events. It was through Python that she got involved with the Irish tech community in 2005. She is a EuroPython Society Fellow, PSF Fellow and Community Service awardee.
cs: Irská Pythonistka se zaměřením na diverzitu v technologiích, která organizuje akce PyLadies Dublin. Díky Pythonu se dostala do irské komunity fanoušků technologií v roce 2005. Je EuroPython Society Fellow, PSF Fellow a nositelkou ceny Community Service.
es: Una Pythonista irlandesa que promueve la diversidad en el sector tecnológico y organiza eventos periódicos de PyLadies Dublin. Fue a través de Python que se involucró con la comunidad tecnológica irlandesa en 2005. Es miembro de la EuroPython Society, miembro de la PSF y galardonada con el premio al Servicio a la Comunidad.
fr: Pythoniste irlandaise prônant la diversité dans le domaine des technologies, elle organise régulièrement des événements PyLadies à Dublin. C'est grâce à Python qu'elle s'est impliquée dans la communauté technologique irlandaise en 2005. Elle est membre de l'EuroPython Society, de la PSF et lauréate du prix Community Service.
pt: Uma Pythonista irlandesa que defende a diversidade na tecnologia e organiza eventos regulares da PyLadies Dublin. Foi através de Python que ela se envolveu com a comunidade tecnológica irlandesa em 2005. Ela é Fellow da EuroPython Society, Fellow da PSF e premiada com Serviço Comunitário.

source: Naa Ashiorkor Nortey is a data scientist and tech community builder. Naa is deeply involved in the Python community, serving in organizing at conferences such as EuroPython. Currently, she is one of the organizers of PyLadies Tampere.
cs: Naa Ashiorkor Nortey je datova vědkyně a tvůrkyně tech komunit. Naa je hluboce angažovaná v Pythonní komunitě, spoluorganizuje konference, jako např. EuroPython. Aktuálně spoluorganizuje PyLadies Tampere.
es: Naa Ashiorkor Nortey es científica de datos y promotora de la comunidad tecnológica. Está muy involucrada en la comunidad Python, participando en la organización de conferencias como EuroPython. Actualmente, es una de las organizadoras de PyLadies Tampere.
fr: Naa Ashiorkor Nortey est data scientist et créatrice & gestionnaire de communautés technologiques. Naa est très impliquée dans la communauté Python, où elle participe à l'organisation de conférences telles que EuroPython. Elle est actuellement l'une des organisatrices de PyLadies Tampere.
pt: Naa Ashiorkor Nortey é uma cientista de dados e construtora de comunidades tecnológicas. A Naa está profundamente envolvida na comunidade Python, servindo na organização de conferências como a EuroPython. Atualmente, é uma das organizadoras da PyLadies Tampere.

source: PyLadies Conference
cs: Konference PyLadies
es: Conferencia de PyLadies
fr: Conférence PyLadies
pt: Conferência PyLadies

source: The Organizers
cs: Organizátorky a organizátoři
es: La organización
fr: Les organisateur.trice.s
pt: As Organizadoras

source: PyLadies is an international mentorship group with a focus on helping more women become active participants and leaders in the Python open-source community. Our mission is to promote, educate and advance a diverse Python community through outreach, education, conferences, events and social gatherings.
cs: PyLadies jsou mezinárodní mentorská skupina, která se soustřeďuje na pomoc ženám stát se aktivními členkami a lídryněmi v Python open source komunitě. Naší misí je propagace, vzdělání a rozvoj různorodé komunity Pythonu skrz outreach, vzdělání, konference, události a společenská setkání.
es: PyLadies es un grupo de tutoría internacional con un enfoque en ayudar a más mujeres a convertirse en participantes activos y líderes en la comunidad de código abierto de Python. Nuestra misión es promover, educar y avanzar en una comunidad de Python diversa a través de alcance, educación, conferencias, eventos y reuniones sociales.
pt: A PyLadies é um grupo internacional de mentoria com foco em ajudar mais mulheres a tornarem-se participantes ativas e líderes na comunidade open-source Python. A nossa missão é promover, educar e fazer avançar uma comunidade Python diversa através de divulgação, educação, conferências, eventos e encontros sociais.

source: To learn more, visit the PyLadies website
cs: Navštivte stránky PyLadies pro víc informací
es: Para obtener más información, visita el sitio web de PyLadies
fr: Pour apprendre plus sur nous, rendez-vous sur notre site internet
pt: Para saber mais, visita o site da PyLadies

source: Search
cs: Vyhledat
es: Buscar
fr: Rechercher
pt: Pesquisar

source: Search by title, speaker, or description...
cs: Vyhledat podle tématu, přednášejícího nebo popisku...
es: Buscar por título, ponente o descripción...
fr: Rechercher par titre, conférencier.e ou description...
pt: Pesquisar por título, oradora ou descrição...

source: Track
cs: Tematický okruh
fr: Thème
pt: Trilha

source: All Tracks
cs: Všechny tematické okruhy
es: Todos los Tracks
fr: Tous les thèmes
pt: Todas as Trilhas

source: Session Type
cs: Druh vystoupení
es: Tipo de Sesión
fr: Session par type
pt: Tipo de Sessão

source: All Types
cs: Všechny druhy
es: Todos los Tipos
fr: Tous les types
pt: Todos os Tipos

source: Level
cs: Úroveň
es: Nivel
fr: Niveau
pt: Nível

source: All Levels
cs: Všechny úrovně
es: Todos los Niveles
fr: Tous les niveaux
pt: Todos os Níveis

source: Language
cs: Jazyk
es: Idioma
fr: Langue
pt: Língua

source: All Languages
cs: Všechny jazyky
es: Todos los Idiomas
fr: Toutes les langues
pt: Todas as Línguas

source: Reset Filters
cs: Zrušit filtry
es: Restablecer Filtros
fr: Effacer les filtres
pt: Limpar Filtros

source: {count} result{plural} found.
cs: Nalezeno {count} výsledků{plural}.
es: {count} resultado{plural} encontrado{plural}.
fr: {count} resultat.s{plural} toruvé.s
pt: {count} resultado{plural} encontrado.

source: No results found.
cs: Nenalezeno výsledky.
es: No se encontraron resultados.
fr: Auncun resultat trouvé.
pt: Nenhum resultado encontrado.

source: Speakers:
cs: Přednášející:
es: Ponentes:
fr: Conférencier.ère.s
pt: Oradoras:

source: Sold out
cs: Vyprodáno

source: Popular
cs: Oblíbené

source: Get Started
cs: Začněte

source: Meet the sponsors of our conference.
cs: Seznamte se se sponzory naší konference.
es: Conoce a los patrocinadores de nuestra conferencia.
fr: Decouvrez les sponsors de notre conférence
pt: Conhece os patrocinadores da nossa conferência.

source: Our Sponsors
cs: Naši sponzoři
es: Nuestros Patrocinadores
fr: Nos Sponsors
pt: Os Nossos Patrocinadores

source: What is the «Keynote Intro»?
cs: Co je «Keynote Intro»?
es: ¿Cuál es la «introducción de nota clave»?
fr: Qu'est-ce qu'une «Introduction Keynote» ?
pt: O que é a «Intro Keynote»?

source: We will play a short 2-5 minutes video from our Champion sponsor before each of the keynote session.
cs: Pustíme krátké - 2-5minutové video našeho Champion sponzora před každou hlavní přednáškou.
es: Reproduciremos un video corto de 2 a 5 minutos de nuestro patrocinador principal antes de cada sesión principal.
fr: Nous diffuserons une courte vidéo de 2 à 5 minutes de notre Sponsor à palier Champion avant chaque Keynote.
pt: Vamos passar um vídeo curto de 2-5 minutos do nosso patrocinador Champion antes de cada sessão de keynote.

source: What is the «Technical Talk Slot»?
cs: Co je «Technical Talk Slot»?
es: ¿Cuál es el «espacio técnico de conversación»?
fr: Qu'est-ce qu'un «Créneau de discussion Technique» ?
pt: O que é o «Slot de Palestra Técnica»?

source: Sponsors on the Champion and Supporter tier will have an accepted talk in the conference. Talks at PyLadiesCon last 15 minutes + 5 minutes Q&A, and the slot will be assigned once the schedule is announced.
cs: Sponzoři ze skupin Champion a Supporter budou mít schválenou přednášku na konferenci. Přednášky trvají 15 minut + 5 minut Q&A, místo bude zveřejněno spolu s rozvrhem.
es: Los patrocinadores en el nivel campeón y defensor tendrán una charla aceptada en la conferencia. Las conversaciones en Pyladiescon duran 15 minutos + 5 minutos de preguntas y respuestas, y la ranura se asignará una vez que se anuncie el horario.
fr: Les sponsors des niveaux Champion et Supporter verront leur proposition de présentation acceptée lors de la conférence. Les présentations à PyLadiesCon durent 15 minutes + 5 minutes de questions-réponses, et le créneau horaire sera attribué une fois le programme annoncé.
pt: Os patrocinadores nos níveis Champion e Supporter terão uma palestra aceite na conferência. As palestras na PyLadiesCon duram 15 minutos + 5 minutos de Q&A, e o slot será atribuído assim que o horário for anunciado.

source: What is the «Panel Discussion»?
cs: Co je «Panelová diskuze»?
es: ¿Cuál es el «Panel de discusión»?
fr: Qu'est-ce un «Panel de Discussion» ?
pt: O que é a «Discussão em Painel»?

source: Participate in a panel discussion formed by Sponsors (topic of choice) with all participants. Share your perspective and clarify participant's questions about the tech industry and the job market. These are the most popular sessions of the conference. It lasts around 35 minutes and is usually allocated on the timezone with higher demand.
cs: Zúčastněte se panelové diskuze sestavené Sponzory (téma je čitě na vás) se všemi účastníky. Podělte se o svou perspektivu a zodpovězte na otázky publika o trhu práce a stavu technologií dnes. Tohle jsou nejoblíbenější druhy obsahu na naší konferenci. Diskuze trvá cca 35 minut a bývá zpravidla v rozvrhu během víc frekventované časové zóny.
es: Participa en un panel de discusión formado por patrocinadores (tema de elección) con todos los participantes. Comparta su perspectiva y aclare las preguntas de los participantes sobre la industria tecnológica y el mercado laboral. Estas son las sesiones más populares de la conferencia. Dura alrededor de 35 minutos y generalmente se asigna en la zona horaria con mayor demanda.
fr: Participez à une table ronde organisée par les sponsors (thème au choix) avec tous les participants. Partagez votre point de vue et répondez aux questions des participants sur le secteur technologique et le marché de l'emploi. Il s'agit des sessions les plus populaires de la conférence Elles durent environ 35 minutes et sont généralement organisées dans le fuseau horaire où la demande est la plus forte.
pt: Participa numa discussão em painel formada por Patrocinadores (tópico à escolha) com todos os participantes. Partilha a tua perspetiva e esclarece as questões dos participantes sobre a indústria tecnológica e o mercado de trabalho. Estas são as sessões mais populares da conferência. Dura cerca de 35 minutos e é geralmente alocada no fuso horário com maior procura.

source: What does the «Mentions in social media» includes?
cs: Co obsahují «Zmínky v social mediích»?
es: ¿Qué incluye las «menciones en las redes sociales»?
fr: Que signifie la mention «Reconnaissance sur nos plateforme sociales» ?
pt: O que incluem as «Menções nas redes sociais»?

source: We will create a series of posts for all our sponsors in order to thank them by their support and post in our social media.
cs: Vytvoříme sérii postů pro všechny naše sponzory, v nichž poděkujeme jim za jejich podporu a zveřejníme je na našich social mediích.
es: Crearemos una serie de publicaciones para todos nuestros patrocinadores para agradecerles por su apoyo y publicación en nuestras redes sociales.
fr: Nous créerons une série de contenu publique pour tous nos sponsors afin de les remercier pour leur soutien et les publierons sur nos réseaux sociaux.
pt: Vamos criar uma série de publicações para todos os nossos patrocinadores para lhes agradecer pelo seu apoio e publicar nas nossas redes sociais.

source: How does the «Speed job interviews» work?
cs: Jak fungují «Rychlé pohovory»?
es: ¿Cómo funciona las «entrevistas de trabajo de velocidad»?
fr: Comment fonctionnent les «Speed job interviews» ?
pt: Como funcionam as «Entrevistas de emprego rápidas»?

source: A fast-paced online networking event where employers and job seekers get 5 minutes to introduce themselves and ask crucial questions. If both parties are interested, they connect for a formal interview afterwards. Participants should be able to check the job description beforehand.
cs: Rychlé networkingové online setkání pro zaměstnavatele a zaměstnance, kde obě strany mají 5 minut na seznámení se a položení hlavních otázek. Pokud obě strany mají zájem, můžou se pak spojit na formální pohovor. Účastníci by měli mít možnost se podívat na popis pracovní pozice před setkáním.
es: Un evento de redes en línea de ritmo rápido donde los empleadores y los solicitantes de empleo obtienen 5 minutos para presentarse y hacer preguntas cruciales. Si ambas partes están interesadas, se conectan para una entrevista formal después. Los participantes deben poder verificar la descripción del trabajo de antemano.
fr: Un événement de réseautage en ligne où les employeurs et les demandeurs d'emploi disposent de 5 minutes pour se présenter et poser des questions cruciales. Si les deux parties sont intéressées, elles se mettent ensuite en accord pour un entretien formel. Les participants doivent pouvoir consulter la description du poste à l'avance.
pt: Um evento de networking online rápido onde empregadores e candidatos têm 5 minutos para se apresentarem e fazerem perguntas cruciais. Se ambas as partes estiverem interessadas, conectam-se para uma entrevista formal posteriormente. Os participantes devem poder verificar a descrição do trabalho com antecedência.

source: Sponsorship Frequently Asked Questions
cs: Často kladené otázky o sponzorství
es: Preguntas Frecuentes de los patrocinios
fr: Foire aux questions sur le sponsoring
pt: Perguntas Frequentes sobre Patrocínio

source: Get Your Ticket
cs: Získejte vstupenku
es: Obtén tu ticket
fr: Obtenez votre ticket
pt: Obtém o Teu Bilhete

source: About
cs: O nás
es: Acerca de
fr: A propos
pt: Sobre

source: The event
cs: Událost
es: El evento
fr: L'événement
pt: O evento

source: The organizers
cs: Organizátorky a organizátoři
es: La organización
fr: Les organisateurs
pt: Os organizadores

source: Volunteers
cs: Dobrovolnictvo
es: Voluntariado

source: Conference
cs: Konference
es: Conferencia
fr: Conférence
pt: Conferência

source: Sessions
cs: Vystoupení
es: Sesiones
pt: Sessões

source: Speakers
cs: Přednášející
es: Ponentes
fr: Conférenciers
pt: Oradoras

source: Sprints
cs: Sprinty

source: How to Join
cs: Jak se přidat
es: Cómo unirse
fr: Comment rejoindre
pt: Como Participar

source: Sponsors
cs: Sponzoři
es: Patrocinadores
pt: Patrocinadores

source: Sponsorship Plans
cs: Úrovně sponzorství
es: Planes de Patrocinio
fr: Palier de sponsoring
pt: Planos de Patrocínio

source: Jobs Board
cs: Nabídky práce
es: Bolsa de Trabajo
fr: Offre d'emploi
pt: Quadro de Empregos

source: Read the CoC
cs: Přečtěte CoC
es: Lee el CdC
fr: Lire le CoC
pt: Ler o CdC

source: Reporting process
cs: Proces reportování
es: Proceso de reportes
fr: Rapport de processus
pt: Processo de denúncia

source: Enforcement process
cs: Proces prosazování
es: Proceso de ejecución
fr: Precessus applicable
pt: Processo de aplicação

source: Error 404
cs: Chyba 404
fr: Erreur 404
pt: Erro 404

source: Sorry, we couldn't find this page.
cs: Omlouváme se, stránka nenalezená.
es: Disculpa, no encontramos ésta página.
fr: Désolé, cette page est introuvable.
pt: Desculpa, não conseguimos encontrar esta página.

source: But dont worry, you can find plenty of other things on our homepage.
cs: Ale nebuďte smutní, spoustu jiných věcí najdete na naší hlavní stránce.
es: Pero no te preocupes, puedes encontrar muchas otras cosas en nuestra página principal.
fr: Mais ne vous inquiétez pas, vous trouverez plein d'autres choses sur notre page d'accueil.
pt: Mas não te preocupes, podes encontrar muitas outras coisas na nossa página inicial.

source: Back to homepage
cs: Zpět na hlavní stránku
es: Volver a la página principal
fr: Retour à la page d'accueil
pt: Voltar à página inicial

source: Get your ticket
cs: Získejte vstupenku
es: Obtén tu entrada
fr: Obtenir votre ticket
pt: Obtém o teu bilhete

source: Visit pretix to get one.
cs: Navštivte pretix pro získání vstupenky.
es: Visita pretix para obtener una.
fr: Rendez-vous sur pretix pour en obtenir un.
pt: Visita o pretix para obteres um.

source: Join Discord
cs: Přidejte se na Discord
es: Únete a Discord
fr: Rejoindre Discord
pt: Junta-te ao Discord

source: Using the invite link
cs: Použijte odkaz s pozvánkou
es: Usando el enlace de invitación
fr: Utiliser le lien d'invitation
pt: Usando o link de convite

source: Register in Discord
cs: Zaregistrujte se na Discordu
es: Regístrate en Discord
fr: S'inscrire sur Discord
pt: Regista-te no Discord

source: With your <b>Name</b> and <b>Order number</b>
cs: Se svým <b>Jménem</b> a <b>Číslem objednávky</b>
es: Con tu <b>Nombre</b> y <b>Número de entrada</b>
fr: Avec votre <b>Name</b> et votre <b>Order number</b>
pt: Com o teu <b>Nome</b> e <b>Número de encomenda</b>

source: Enjoy the conference!
cs: Užijte si konferenci!
es: ¡Disfruta la conferencia!
fr: Profitez de la conférence
pt: Aproveita a conferência!

source: Check the server structure
cs: Podívejte se na strukturu severu
es: Mira la estructura del server
fr: Vérifier la structure du serveur
pt: Verifica a estrutura do servidor

source: The online venue of the conference
cs: Místo naší konference
es: El lugar online de la conferencia
fr: Le lieu de l'évènement en ligne
pt: O local online da conferência

source: Attending PyLadiesCon
cs: Účast na PyLadiesCon
es: Asistir a PyLadiesCon
fr: Participer à PyLadiesCon
pt: Participar na PyLadiesCon

source: Join the conference Discord server to meet every participant, including Speakers, Sponsors, Keynotes, Volunteers and Organizers. Enjoy talks, workshops, open spaces, get stream links, and many more activities!
cs: Přidejte se na Discord, kde potkáte všechny účastnice a účastníky, v tom přednášející, sponzory, hlavní řečnice, dobrovolnictvo a organizátorstvo. Užijte si přednášky, workshopy, open spaces a mnoho dalších aktivit!
es: Únete al servidor de Discord de la conferencia para conocer a todas las personas que participan, incluidos ponentes, patrocinadores, oradores principales, voluntarios y organizadores. ¡Disfruta de charlas, talleres, espacios abiertos, obtén enlaces a las transmisiones en directo y muchas actividades más!
fr: Rejoignez le serveur Discord de la conférence pour rencontrer tous les participants, y compris les conférenciers, sponsors, intervenants principaux, bénévoles et organisateurs. Profitez des discussions, des ateliers, des espaces collaboratifs, obtenez des liens de streaming et participez à de nombreuses autres activités !
pt: Junta-te ao servidor Discord da conferência para conheceres todos os participantes, incluindo Oradoras, Patrocinadores, Keynotes, Voluntários e Organizadores. Aproveita as palestras, workshops, espaços abertos, obtém links de transmissão e muitas outras atividades!

source: Follow the next steps to enjoy the conference:
cs: Ještě pár kroků a můžete se k nám přidat:
es: Sigue los siguientes pasos para disfrutar de la conferencia:
fr: Suivez les étapes suivantes pour profiter de la conférence :
pt: Segue os próximos passos para aproveitar a conferência:

source: Update
cs: Aktualizace
es: Actualización
fr: Mise à jour
pt: Atualização

source: The discord server is available!
cs: Discord je přístupný!
es: ¡El servidor discord está disponible!
fr: Le serveur Discord est disponible !
pt: O servidor discord está disponível!

source: <span class="font-bold">Important:</span> every participant needs a <a class="underline" href="https://pretix.eu/pyladiescon/2025">conference ticket</a> in order to access the right channels in the Discord server; including Participants, Volunteers, and Sponsors.
cs: <span class="font-bold">Důležité:</span> každá účastnice a účastník potřebuje <a class="underline" href="https://pretix.eu/pyladiescon/2025">vstupenku</a> pro přístup do všech kanálů na Discordu, nevyjímaje účastnictvo, dobrovolnictvo a sponzory.
es: <span class="font-bold">Importante:</span> todas las personas que asisten a la conferencia necesitan un <a class="underline" href="https://pretix.eu/pyladiescon/2025">ticket de la conferencia</a> para poder acceder a los canales correctos en el servidor de Discord; incluyendo Participantes, Voluntarios, y Patrocinantes.
fr: <span class="font-bold">Important:</span> chaque participant doit disposer d'un <a class="underline" href="https://pretix.eu/pyladiescon/2025">ticket de conférence</a> afin d'accéder aux bons canaux sur le serveur Discord ; y compris les participants, les bénévoles et les sponsors.
pt: <span class="font-bold">Importante:</span> cada participante precisa de um <a class="underline" href="https://pretix.eu/pyladiescon/2025">bilhete da conferência</a> para aceder aos canais certos no servidor Discord; incluindo Participantes, Voluntários e Patrocinadores.

source: You can get a conference ticket on <a href="https://pretix.eu/pyladiescon/2025">our pretix page</a>.
cs: Vstupenku na konferenci můžete získat na <a href="https://pretix.eu/pyladiescon/2025">našem pretixu</a>.
es: Puedes obtener un ticket de la conferencia en <a href="https://pretix.eu/pyladiescon/2025">nuestra página en pretix</a>.
fr: Vous pouvez obtenir un ticket pour la conférence sur <a href="https://pretix.eu/pyladiescon/2025">notre page Pretix</a>.
pt: Podes obter um bilhete da conferência na <a href="https://pretix.eu/pyladiescon/2025">nossa página pretix</a>.
