{
  "33W8ES": {
    "abstract": "In this talk, I will introduce a prototype that allows a small car powered by a Raspberry Pi Pico to be controlled using multimodal input such as voice and images.\r\nVoice commands and hand-drawn routes are entered via Gradio and converted into instructions like “move forward” or “turn right” using LangChain.\r\nThe Pico acts as an HTTP server, receives these commands over Wi-Fi, and controls the car accordingly.\r\nI’ll share the system structure and technologies used, along with the fun and creative challenges I encountered during development.\r\nIt’s a fun project that combines generative AI and IoT!\r\n\r\n---\r\n\r\n本発表では、音声や画像といったマルチモーダルな入力から、Raspberry Pi Picoで動く小型カーを制御する試みを紹介します。\r\n構成としては、Gradioで音声や手描きルートを入力し、それをLangChainを使って「前進」「右折」などを意味するコマンドに変換。Picoは簡易的なHTTPサーバとして動作し、Wi-Fi経由で指示を受けてカーを制御します。\r\n本発表では、この構成と技術要素を共有しながら、実際に試してみて感じた楽しさや工夫した点をお伝えできればと思っています。\r\nゆるく楽しく「生成AI × IoT」の可能性を探る取り組みです！",
    "code": "33W8ES",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "ja",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "go-straight-then-turn-right-how-i-built-a-voice-controlled-toy-car-using-generative-ai-gradio-and-raspberry-pi-pico",
    "speakers": [
      "RY9CPQ"
    ],
    "start": null,
    "title": "“Go Straight, Then Turn Right!”: How I Built a Voice-Controlled Toy Car Using Generative AI, Gradio, and Raspberry Pi Pico",
    "track": "AI / ML",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/go-straight-then-turn-right-how-i-built-a-voice-controlled-toy-car-using-generative-ai-gradio-and-raspberry-pi-pico",
    "youtube_url": null
  },
  "39QG9D": {
    "abstract": "What happens when your career accelerates just as your personal life transforms completely?\r\nThis talk is a reflection on navigating the winding path from Python enthusiast to tech leader, then becoming a mother—and eventually rediscovering the joy of coding, community, and self through Python.\r\n\r\nThrough honest stories and hard-earned lessons, I’ll share:\r\n\r\n- How motherhood reshaped my identity as a leader and technologist\r\n\r\n- Reconnecting with my Python roots—technically, emotionally, and creatively\r\n\r\n- How leadership doesn’t mean giving up your craft—it can mean redefining it\r\n\r\nThis isn’t a talk about having it all figured out. It’s about permission: to evolve, to pause, to pivot—and to come back stronger, on your own terms. Whether you're a new parent, a mid-career technologist, or someone finding your way back to Python, I hope you'll see a piece of your journey in mine.",
    "code": "39QG9D",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "rebooting-myself-motherhood-leadership-and-coming-home-to-python",
    "speakers": [
      "WHRL9U"
    ],
    "start": null,
    "title": "Rebooting Myself: Motherhood, Leadership, and Coming Home to Python",
    "track": "Leadership skills",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/rebooting-myself-motherhood-leadership-and-coming-home-to-python",
    "youtube_url": null
  },
  "3KNKHS": {
    "abstract": "What if the tools we use to predict disease risk don't work for entire populations, simply because very few people (studies) test them over there? That's the case for many polygenic risk score (PRS) models and pipelines, which often fail when applied to African genomes. PRS is a number that estimates how likely someone is to develop a disease based on their DNA. In this talk, I'll walk through how I, a self-taught bioinformatician, learner and currently a PhD. student, am using Python to build something better: a reproducible pipeline for PRS tools that center inclusion.\r\nMore than a technical talk, this is a story about learning, persistence and impact. I'll share how I use accessible Python libraries like argparse, pandas, subprocess and shutil to automate preprocessing, handle containerised PRS tools with Docker, and stitch everything together using workflows like Nextflow. Without waiting to be an expert, I am building a solution for breast cancer, a global health problem that affects millions of women around the world.\r\nThe tools I'm building are still a work in progress, but this talk will spotlight the imperfect, iterative process of building (while learning) pipelines that don't exclude underrepresented populations by design. I'll share how Python makes it possible to go from fragmented data to actionable results.\r\nThis talk is for anyone curious about bioinformatics, passionate about global inclusion or simply learning Python and wondering, \"What can I build that matters?\"",
    "code": "3KNKHS",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "python-in-africa-s-dna-building-inclusive-and-reproducible-genomic-tools",
    "speakers": [
      "7QVDVR"
    ],
    "start": null,
    "title": "Python in Africa's DNA: Building Inclusive and Reproducible Genomic Tools",
    "track": "The Python programming language",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/python-in-africa-s-dna-building-inclusive-and-reproducible-genomic-tools",
    "youtube_url": null
  },
  "3RFQUE": {
    "abstract": "Behind every great data product is a perfectly balanced recipe of tools and methodologies, and Python is the master chef that can bring them all together.\r\nIn this talk, we’ll serve a real-world case study that walks through each step of building a modern, end-to-end data stack:\r\nWe’ll start by sourcing raw ingredients (data ingestion), prepping and mixing them (transformation and modeling), managing the kitchen (workflow orchestration), and finally plating a gourmet dish (delivering insights). \r\nWhether you're a data engineer, analyst, or developer, you’ll walk away with a practical blueprint for building scalable, modern data workflows with just the right ingredients, and no risk of burning the cake.",
    "code": "3RFQUE",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "python-powered-data-engineering-how-to-build-a-modern-end-to-end-stack",
    "speakers": [
      "7G8DH3"
    ],
    "start": null,
    "title": "Python-Powered Data Engineering: how to build a modern, end-to-end stack.",
    "track": "The Python programming language",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/python-powered-data-engineering-how-to-build-a-modern-end-to-end-stack",
    "youtube_url": null
  },
  "7BB9MZ": {
    "abstract": "Are you tired of doing the same tedious tasks over and over? This session is your opportunity to turn a computer from a chore into a collaborator. Geared toward beginners, this talk will be a practical, hands-on guide to using Python to automate the mundane and free up your time for more impactful work.\r\n\r\nThrough live coding, we’ll tackle common annoyances like organizing messy file folders, sending routine emails, and even interacting with websites. We’ll cover the basic tools you need to get started and a few simple principles for making your automation scripts reliable. You’ll leave with the knowledge and confidence to build your own \"personal assistant\" scripts, empowering you to work smarter, not harder. Join us and discover the power of automation to reclaim your time and energy.",
    "code": "7BB9MZ",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": [
      {
        "description": "Python pathlib Documentation",
        "resource": "https://docs.python.org/3/library/pathlib.html"
      },
      {
        "description": "Python smtplib Documentation",
        "resource": "https://docs.python.org/3/library/smtplib.html"
      },
      {
        "description": "Selenium Python Documentation",
        "resource": "https://selenium-python.readthedocs.io/"
      }
    ],
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "python-for-automation-getting-rid-of-repetitive-tasks-and-reclaiming-your-time",
    "speakers": [
      "TCSZSH"
    ],
    "start": null,
    "title": "Python for Automation: Getting Rid of Repetitive Tasks and Reclaiming Your Time",
    "track": "Useful Python libraries",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/python-for-automation-getting-rid-of-repetitive-tasks-and-reclaiming-your-time",
    "youtube_url": null
  },
  "7UL7TG": {
    "abstract": "Open source runs on passion, but passion is not a renewable resource. This talk will explore the hidden emotional and social costs of contributing to open-source projects. From burnout to invisibility, we’ll reflect on how the very communities we depend on can unintentionally exhaust the people keeping them alive. Attendees will walk away with practical ways to support contributors, make communities more welcoming, and build open source that truly includes everyone.",
    "code": "7UL7TG",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "not-just-code-building-communities-that-dont-burn-people-out",
    "speakers": [
      "NMFFCT"
    ],
    "start": null,
    "title": "Not Just Code: Building Communities That Don’t Burn People Out",
    "track": "Community management",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/not-just-code-building-communities-that-dont-burn-people-out",
    "youtube_url": null
  },
  "89CQX7": {
    "abstract": "Once upon a time, if you wanted to build a modern web experience using a Python based web framework, an obvious choice was to expose a bunch of APIs and build your frontend in something else entirely (eg React).\r\n\r\nTimes have changed.\r\n\r\nTools like HTMX and AlpineJS have made HTML great again.\r\n\r\nThis talk is a demonstration and explanation of the power of these tools.",
    "code": "89CQX7",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "modern-frontend-development-the-simple-way",
    "speakers": [
      "YLSDKF"
    ],
    "start": null,
    "title": "Modern frontend development the simple way",
    "track": "The Python programming language",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/modern-frontend-development-the-simple-way",
    "youtube_url": null
  },
  "9BXCRG": {
    "abstract": "A palestra “Materiais desconectados como recurso pedagógico” apresenta estratégias práticas para ensinar Python em contextos com acesso limitado à internet, promovendo inclusão digital e equidade no aprendizado tecnológico. Em um país onde milhões ainda enfrentam barreiras de conectividade, é urgente pensar em soluções que não dependam exclusivamente do online.\r\nDurante os 20 minutos de apresentação, serão compartilhadas experiências reais de ensino de programação com materiais desconectados — como PDFs interativos, vídeos locais, simuladores offline e notebooks Jupyter pré-carregados. A proposta é mostrar como esses recursos podem ser utilizados em oficinas comunitárias, escolas públicas e espaços de educação informal, respeitando as especificidades de cada território.\r\nAlém dos recursos técnicos, a palestra abordará metodologias pedagógicas inclusivas, como o ensino por projetos, a contextualização do conteúdo e a valorização da cultura local. Serão apresentados exemplos de como jovens e adultos, mesmo sem acesso contínuo à internet, podem aprender Python de forma significativa, desenvolver autonomia digital e criar soluções para suas comunidades.\r\nVoltada para educadores, desenvolvedores, ativistas e membros da comunidade PyLadies, a palestra convida à reflexão sobre o papel da tecnologia na redução das desigualdades e propõe caminhos concretos para tornar o ensino de Python mais acessível, diverso e transformador.",
    "code": "9BXCRG",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "pt",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "materiais-desconectados-como-recurso-pedagogico-estrategias-para-ensinar-python-em-contextos-com-acesso-limitado-a-internet",
    "speakers": [
      "TCA73V"
    ],
    "start": null,
    "title": "Materiais desconectados como recurso pedagógico: Estratégias para ensinar Python em contextos com acesso limitado à internet.",
    "track": "Education",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/materiais-desconectados-como-recurso-pedagogico-estrategias-para-ensinar-python-em-contextos-com-acesso-limitado-a-internet",
    "youtube_url": null
  },
  "9UC39C": {
    "abstract": "La operación de drones en entornos complejos y peligrosos, como inspecciones industriales en interiores, presenta un alto riesgo de colisiones y requiere una gran destreza por parte del piloto. ¿Y si pudiéramos darle al piloto un copiloto de inteligencia artificial que anticipe errores y garantice la seguridad?\r\n\r\nEn esta charla, exploraremos cómo desarrollar un sistema de teleoperación asistida para cuadricópteros utilizando Python, simulación y aprendizaje por refuerzo profundo (Deep RL). Partiremos desde cero, configurando un entorno de simulación fotorrealista con Webots para entrenar un agente de IA. Veremos cómo, usando librerías como stable-baselines3 e imitation, podemos enseñar a un dron a navegar de forma óptima y, lo más interesante, cómo usar ese conocimiento para asistir a un piloto humano.\r\n\r\nProfundizaremos en el concepto de \"autonomía compartida\", donde el sistema de IA no reemplaza al humano, sino que colabora con él. Mostraremos cómo simulamos pilotos con comportamientos \"humanos\" (con retrasos o errores) para entrenar un copiloto que interviene solo cuando es necesario, corrigiendo trayectorias peligrosas y previniendo accidentes.\r\n\r\nAl final de esta sesión, no solo entenderás los fundamentos para aplicar aprendizaje por refuerzo en robótica, sino que también verás un caso práctico de cómo Python se convierte en el puente entre una idea compleja de IA y una aplicación funcional con impacto en el mundo real. Descubrirás un flujo de trabajo completo para prototipar, entrenar y evaluar sistemas robóticos inteligentes de manera segura y eficiente, abriendo la puerta a innumerables aplicaciones industriales.",
    "code": "9UC39C",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "es",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "entrenando-un-copiloto-ia-para-drones-de-la-simulacion-en-python-al-vuelo-asistido",
    "speakers": [
      "KFWB9G"
    ],
    "start": null,
    "title": "Entrenando un copiloto IA para drones: de la simulación en Python al vuelo asistido",
    "track": "AI / ML",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/entrenando-un-copiloto-ia-para-drones-de-la-simulacion-en-python-al-vuelo-asistido",
    "youtube_url": null
  },
  "9WVZB8": {
    "abstract": "Building and nurturing an open source developer community in Armenia comes with challenges that might be surprising if you’re used to communities in the US or in Europe. In this talk, I’ll share how I applied community-building strategies to create a more diverse and inclusive space with shared purpose, and spark meaningful collaboration. Gain actionable insights that you can take back to your own developer communities, wherever they are.\r\n\r\nI’ll talk about:\r\nHow I am trying to launch community initiatives in this region (5 minutes)\r\nHow I started and grew an open source community user group (5 minutes)\r\nHow I am navigating the cultural differences, my experiences and the challenges (5 minutes)",
    "code": "9WVZB8",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "hy",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "how-i-built-an-open-source-community-lessons-learned-from-starting-a-user-group-in-armenia",
    "speakers": [
      "TEJVNB"
    ],
    "start": null,
    "title": "How I built an open source community: Lessons learned from starting a user group in Armenia",
    "track": "Community management",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/how-i-built-an-open-source-community-lessons-learned-from-starting-a-user-group-in-armenia",
    "youtube_url": null
  },
  "A7MQRH": {
    "abstract": "In Africa, getting inclusive education is still quite difficult, especially for kids with learning difficulties like dyslexia. Imprecise word comprehension and generally subpar reading performance are hallmarks of dyslexia, a neurological disease. It impacts a sizable portion of school-age children, with a higher prevalence in boys, putting them at lifetime risk for subpar academic achievement and low self-esteem.\r\nThe United Nations Educational, Scientific, and Cultural Organization (UNESCO) believes that between 10% and 20% of people worldwide suffer with dyslexia, indicating that the disorder is highly prevalent. It might potentially be as high as 30% in low-income areas.\r\nIn traditional educational institutions, children with dyslexia frequently encounter obstacles that restrict their exposure to critical skills like programming, which are vital in the digital age. IT skills are a crucial tool to support dyslexic pupils because they can help them learn and reduce difficulties with identifying or confusing words and meaning. Several studies have demonstrated the importance of exposing students to IT skills, such as programming, especially those with special learning difficulties. Pupils with dyslexia typically have low expectations for their academic opportunities and low self-esteem. \r\n\r\nThis talk examines how Python's ease of use and adaptability might be utilized to produce educational materials and programming tools that are accessible to dyslexic kids in underdeveloped countries. These resources are perfect for countries with limited resources because they require less infrastructure for technology.\r\nJoin us as we explore python for inclusive education and creating a new generation of pupils who are masters of digital skills regardless of their situation and showing that coding is for everyone, breaking barriers and giving equal opportunities to dyslexic kids.",
    "code": "A7MQRH",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "breaking-educational-barriers-for-pupils-with-dyslexia-using-python-in-africa",
    "speakers": [
      "8AXEMT"
    ],
    "start": null,
    "title": "Breaking educational barriers for pupils with dyslexia using python in Africa.",
    "track": "Education",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/breaking-educational-barriers-for-pupils-with-dyslexia-using-python-in-africa",
    "youtube_url": null
  },
  "AGGQXK": {
    "abstract": "Most ML projects never reach real-world use. This session takes a medical imaging model for diabetic retinopathy and turns it into a lightweight FastAPI service. We will cover training with PyTorch Lightning, secure image handling, and deployment in resource-limited settings. Attendees will leave with a working Python template for bringing their models from experimentation to practical clinical application.",
    "code": "AGGQXK",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "from-notebooks-to-the-clinic-building-a-simple-medical-imaging-api",
    "speakers": [
      "PUYUYE"
    ],
    "start": null,
    "title": "From Notebooks to the Clinic: Building a Simple Medical Imaging API",
    "track": "AI / ML",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/from-notebooks-to-the-clinic-building-a-simple-medical-imaging-api",
    "youtube_url": null
  },
  "AWCC7R": {
    "abstract": "My personal perspectives from looking for a job as a FLINTA Python Engineer in 2025.",
    "code": "AWCC7R",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "flinta-job-hunting-in-2025",
    "speakers": [
      "CYGEJV"
    ],
    "start": null,
    "title": "FLINTA job hunting in 2025",
    "track": "Leadership skills",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/flinta-job-hunting-in-2025",
    "youtube_url": null
  },
  "BUP8JK": {
    "abstract": "Draft",
    "code": "BUP8JK",
    "delivery": "",
    "duration": "30",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Keynote",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "draft",
    "speakers": [
      "SKGET8"
    ],
    "start": null,
    "title": "Draft",
    "track": "The Python programming language",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/draft",
    "youtube_url": null
  },
  "C7W8QM": {
    "abstract": "In this presentation, my son and I will talk about building a random route generator to augment the board game Ticket to Ride.  Our code chooses cities at random and computes their shortest distance, which translates to points in the game.  We explore playful learning and the concepts of computational thinking to learn and implement an algorithm.   It’s been a joy to share my love of coding and we are working to improve our project.",
    "code": "C7W8QM",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "ticket-to-ride-python-augmenting-our-favorite-board-game-with-a-random-route-generator",
    "speakers": [
      "TC39WF"
    ],
    "start": null,
    "title": "Ticket To Ride + Python - Augmenting our favorite board game with a random route generator",
    "track": "The Python programming language",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/ticket-to-ride-python-augmenting-our-favorite-board-game-with-a-random-route-generator",
    "youtube_url": null
  },
  "CCAGCB": {
    "abstract": "Interactive data exploration tools are excellent for visualizing the data as you are cleaning it, but when a data practitioner analyzes data through drag-and-drop interfaces, the path to reproducibility becomes opaque. This project bridges that gap by capturing UI interactions in the Positron IDE and converting them into clean, readable code across pandas, polars, SQL, and multiple R syntaxes.\r\n\r\nThis talk will include a demonstration of exploring data with a UI and converting that exploration into reproducible code. We’ll walk through the architecture that makes this possible, from tracking UI changes to generating semantically equivalent code across different data manipulation libraries. We’ll also discuss the challenges and considerations that went into the design.\r\n\r\nThis work addresses a critical need in the data science community: tools that enhance usability and reproducibility. Whether you’re building data science tools, analyzing data, or simply frustrated by the gap between exploration and reproduction, this talk will show how thoughtful design can make reproducible science as easy as point-and-click.",
    "code": "CCAGCB",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "making-gui-data-exploration-reproducible-with-python",
    "speakers": [
      "CBMJA7"
    ],
    "start": null,
    "title": "Making GUI Data Exploration Reproducible with Python",
    "track": "Others",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/making-gui-data-exploration-reproducible-with-python",
    "youtube_url": null
  },
  "CMYZH3": {
    "abstract": "La IA está creciendo de forma exponencial ¿Cómo podemos usar su poder para el bien? En esta charla abordaremos un proyecto que apoya la independencia femenina y devuelve el control de la anticoncepción a las personas gestantes. Se expondrá ContraceptEase, proyecto que usando Flask y Agentes de IA, logra transmitir alertas sanitarias a usuarias de anticonceptivos hormonales en Chile.",
    "code": "CMYZH3",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "es",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "crear-proyectos-de-ia-desde-una-perspectiva-femenina",
    "speakers": [
      "F8QLX9"
    ],
    "start": null,
    "title": "Crear proyectos de IA desde una perspectiva femenina.",
    "track": "Web development",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/crear-proyectos-de-ia-desde-una-perspectiva-femenina",
    "youtube_url": null
  },
  "CU33B8": {
    "abstract": "Documentation is a community product. This session shares lessons from organizing PyLadies Boston and contributing to open-source docs. We’ll cover how to build inclusive contributor pipelines, run doc sprints, and use GitHub workflows to scale documentation efforts.",
    "code": "CU33B8",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "community-driven-documentation-what-pyladies-taught-me-about-docs",
    "speakers": [
      "NSTXEP"
    ],
    "start": null,
    "title": "Community-Driven Documentation: What PyLadies Taught Me About Docs",
    "track": "Community management",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/community-driven-documentation-what-pyladies-taught-me-about-docs",
    "youtube_url": null
  },
  "DA7ZYQ": {
    "abstract": "The classic open source dichotomy is well known: everyone uses it, but few give back for the convenience we've all grown so used to. What sustains a community? And how can we help ensure that the frameworks and libraries we rely on daily remain viable and healthy in the long run? In this talk, I intend to show how easy it is to get started with your open source contributions, regardless of your seniority.",
    "code": "DA7ZYQ",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "what-if-you-became-an-open-source-software-contributor",
    "speakers": [
      "YY9HAB"
    ],
    "start": null,
    "title": "What if you became an open source software contributor?",
    "track": "The Python community",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/what-if-you-became-an-open-source-software-contributor",
    "youtube_url": null
  },
  "DL9FEZ": {
    "abstract": "Too often, we run Python workshops, teach people the basics, and then… leave. And while those workshops are exciting and inspiring, they’re not enough. In this talk, I’ll share lessons from years of teaching and what I learned organizing Django Girls Koforidua. I’ll walk through practical ways to move beyond one-off workshops to building real learning experiences: supportive environments, hands-on projects, and community-based follow-ups that help learners grow and stay engaged. Whether you’re an educator, developer, or community organizer, you’ll leave with ideas for how to make your next workshop the beginning of a learning journey—not the end of one.",
    "code": "DL9FEZ",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "workshops-are-a-start-not-a-path",
    "speakers": [
      "Z9DWXE"
    ],
    "start": null,
    "title": "Workshops Are a Start, Not a Path",
    "track": "Education",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/workshops-are-a-start-not-a-path",
    "youtube_url": null
  },
  "DPD9ME": {
    "abstract": "Vivemos num tempo em que os sistemas de Inteligência Artificial estão cada vez mais presentes em decisões que afectam directamente as nossas vidas: desde recrutamento, acesso a crédito até recomendações e diagnósticos médicos. No entanto, por trás dessas decisões, há algoritmos que podem reproduzir ou até amplificar desigualdades históricas.",
    "code": "DPD9ME",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "pt",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "verificacao-etica-em-modelos-de-ia-usando-ferramentas-open-source",
    "speakers": [
      "PKJQTM"
    ],
    "start": null,
    "title": "Verificação ética em modelos de IA usando ferramentas open source",
    "track": "AI / ML",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/verificacao-etica-em-modelos-de-ia-usando-ferramentas-open-source",
    "youtube_url": null
  },
  "DQB3PR": {
    "abstract": "Learn how to build open-source bilingual dictionaries for Indonesia’s local languages using Python NLP libraries such as spaCy, NLTK, and Transformers. This talk explores practical methods to process low-resource languages, including hybrid rule-based and transformer models. We will discuss how to build dictionary data pipelines and add features like search, synonyms, antonyms, and lemmatization. The session also highlights the role of open-source collaboration in preserving linguistic diversity through technology.",
    "code": "DQB3PR",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "building-digital-dictionaries-for-local-languages-in-indonesia-with-python-nlp",
    "speakers": [
      "ERBJFG"
    ],
    "start": null,
    "title": "Building Digital Dictionaries for Local Languages in Indonesia with Python NLP",
    "track": "AI / ML",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/building-digital-dictionaries-for-local-languages-in-indonesia-with-python-nlp",
    "youtube_url": null
  },
  "EPHCZC": {
    "abstract": "Large Language Models are trained to produce helpful, safe answers—but what happens when someone tries to make them misbehave? Malicious users can manipulate prompts to generate unsafe content like hate speech or violent instructions. Every time we add an LLM to an app, we open up that risk.\r\n\r\nIn this talk, I’ll show how to use Python to red-team an LLM-powered app: simulating hundreds of bad actors to see how the system holds up. We’ll explore public datasets of adversarial prompts, and use the open-source pyrit package to obfuscate attacks with strategies like base-64 encoding and Caesar cipher. Finally, we’ll evaluate which attacks succeed, using another LLM to score the results.\r\n\r\nAttendees will walk away with a practical understanding of how to stress-test their own apps and a toolkit for keeping them safer against trolls.",
    "code": "EPHCZC",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "beware-the-trolls-red-teaming-for-llm-powered-apps",
    "speakers": [
      "CLHQXK"
    ],
    "start": null,
    "title": "BEWARE THE TROLLS: Red-teaming for LLM-powered apps",
    "track": "AI / ML",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/beware-the-trolls-red-teaming-for-llm-powered-apps",
    "youtube_url": null
  },
  "GJNWXT": {
    "abstract": "Stratified sampling helps ensure representative data subsets, especially when working with imbalanced groups. In this talk, we’ll explore its use in survey analysis, demonstrate Python-based implementation, and share best practices for improving data reliability and reducing bias. Attendees will gain a clear understanding of when and how to use stratified sampling effectively in real-world scenarios.",
    "code": "GJNWXT",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "stratified-sampling-in-survey-research",
    "speakers": [
      "BEXEUC"
    ],
    "start": null,
    "title": "Stratified Sampling in Survey Research",
    "track": "The Python programming language",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/stratified-sampling-in-survey-research",
    "youtube_url": null
  },
  "GMGLFN": {
    "abstract": "Have you heard the expression, Losing the Forest Through the Trees? In a nutshell it means being so focused on details that we miss the bigger picture.\r\n\r\nOften in geospatial we are guilty as charged. It is about this tool or that platform vs the important work at hand. Building efficient workflows are an important part of building capacity to hold bigger stories.\r\n\r\nA powerful workflow I share when building data stories includes multi-faceted python libraries integrated with a wide variety of visual storytelling tools. Specifically QGIS, blender, Unreal engine and open source integration bringing a series of interconnected issues—including deforestation, pollution, habitat destruction, and biodiversity loss—representing a detachment from ecological systems, exacerbated by not only the energy requirements of exponential AI implementation but global industrial practices that allow environmental harm to be displaced geographically and socially.\r\n\r\nQuantitative Storytelling portrays an intricate dance between objective reality—Using the city as an operational unit we will build schema from multiple data sources and learn to tell stories about urban form and morphometrics learning from social demographics and the vulnerabilities encountered with climate risk and change.",
    "code": "GMGLFN",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "decoding-climate-science-with-python-and-open-data-resources-what-ais-energy-needs-mean-for-our-planet",
    "speakers": [
      "SEKTPR"
    ],
    "start": null,
    "title": "Decoding Climate Science with Python and Open Data Resources: What AI’s Energy Needs Mean for Our Planet",
    "track": "The Python programming language",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/decoding-climate-science-with-python-and-open-data-resources-what-ais-energy-needs-mean-for-our-planet",
    "youtube_url": null
  },
  "HBMEYA": {
    "abstract": "When we define our own classes in Python, they often don’t behave like built-in types especially when we try to use operators like +. In this short talk, we’ll look at how to fix that by using Python’s special methods. With a hands-on example using \\_\\_add\\_\\_ , we’ll see how to make our objects work the way we expect, and why this improves code readability and maintainability. A useful tool in your Python toolkit, even if you're not writing mathematical code.",
    "code": "HBMEYA",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "can-we-add-objects-the-way-we-do-for-numbers",
    "speakers": [
      "DNUJPT"
    ],
    "start": null,
    "title": "Can We Add Objects the Way We Do for Numbers?",
    "track": "The Python programming language",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/can-we-add-objects-the-way-we-do-for-numbers",
    "youtube_url": null
  },
  "HNZPGJ": {
    "abstract": "Whether your working in data, web development, automation or embedded systems, you've probably had a time when you felt like it was team challenges, not technical challenges, holding you back. Hopefully you've also had a time when you had a great team solving tough problems, where the team made everything feel easier. In this talk we'll look at how an understanding of group development models can help improve your technical team experiences - even if you're not the leader of the team.",
    "code": "HNZPGJ",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "strengthen-technical-teams-through-group-development-models",
    "speakers": [
      "JNGHT3"
    ],
    "start": null,
    "title": "Strengthen technical teams through group development models",
    "track": "Leadership skills",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/strengthen-technical-teams-through-group-development-models",
    "youtube_url": null
  },
  "HSUHCH": {
    "abstract": "Can data engineering be feminist? Absolutely. As data engineers and Python developers, the decisions we make about what data to collect, how we transform it, and who gets access carry ethical weight. This talk explores how we can apply feminist principles like transparency, consent, and equity to build more ethical data pipelines. Through real-world examples of harm caused by opaque and biased data systems, we’ll examine how even routine ETL work can reinforce injustice. We’ll then outline practical approaches for designing pipelines that center care and accountability covering techniques like schema minimization, anonymization in Python, and documenting data provenance. Attendees will leave with a deeper understanding of how to challenge extractive data practices and use their technical skills to push back against surveillance capitalism and systemic bias.",
    "code": "HSUHCH",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "feminist-pipelines-engineering-accountability-into-your-data-stack",
    "speakers": [
      "LXQGX3"
    ],
    "start": null,
    "title": "Feminist Pipelines: Engineering Accountability into Your Data Stack",
    "track": "The Python programming language",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/feminist-pipelines-engineering-accountability-into-your-data-stack",
    "youtube_url": null
  },
  "JFDDUV": {
    "abstract": "As a language teacher turned AI developer, I set out to create something that combines both of my passions: a self-hosted Swedish tutor powered by open-source models. This DIY project combines Ollama, LangGraph, and Gradio into a modular system that runs locally, delivers nuanced feedback, and costs nothing to run. No cloud inference, no API keys, just a playful, powerful way to decentralize AI and make language learning fun again.",
    "code": "JFDDUV",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "building-a-self-hosted-ai-swedish-tutor-a-lovechild-of-teaching-and-tech",
    "speakers": [
      "R9YNT9"
    ],
    "start": null,
    "title": "Building a Self-Hosted AI Swedish Tutor: A Lovechild of Teaching and Tech",
    "track": "AI / ML",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/building-a-self-hosted-ai-swedish-tutor-a-lovechild-of-teaching-and-tech",
    "youtube_url": null
  },
  "JSXHTQ": {
    "abstract": "Sabemos que uma comunidade de código aberto não se resume apenas ao código, mas também às interações e conexões interpessoais. No entanto, como podemos medir e compreender o sentimento de pertença que nos torna mais confiantes para contribuir para o código aberto, após experienciarmos um ambiente verdadeiramente inclusivo? As emoções são tão importantes para a participação quanto as competências técnicas que os membro adquirem ao longo do tempo.\r\n\r\nNesta palestra, apresentarei uma análise baseada em dados concretos sobre como a dinâmica emocional afeta o crescimento, a inclusão e a sustentabilidade dos capítulos das PyLadies. A partir de dados de inquéritos, experiências vividas e das melhores práticas da psicologia comunitária, abordarei:\r\n1. O papel das emoções na construção da confiança, segurança e colaboração;\r\n2. Como reconhecer os primeiros sinais de desmotivação e esgotamento emocional em voluntários (Baseado em simulações usando Python + LLMs - experiente em andamento);\r\n\r\nNo final, espero trazer pontos de reflexão sobre as dinâmicas emocionais e seus influentes.",
    "code": "JSXHTQ",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "pt",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "beyond-code-dinamicas-emocionais-das-comunidades-pyladies",
    "speakers": [
      "TJGMMZ"
    ],
    "start": null,
    "title": "Beyond Code: Dinâmicas Emocionais das Comunidades PyLadies",
    "track": "Community management",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/beyond-code-dinamicas-emocionais-das-comunidades-pyladies",
    "youtube_url": null
  },
  "JV7TG9": {
    "abstract": "Around the world, billions of dollars are flowing into nature-based solutions to tackle climate change, biodiversity loss, and land degradation. But ensuring that these investments deliver real, measurable results is a major challenge. At the World Resources Institute (WRI), our Restoration Monitoring team is using Python to transform how restoration progress is tracked, verified, and shared, with the goal of bringing greater trust and transparency to the movement.\r\nThis talk will showcase how we combine Python’s rich ecosystem of data science, geospatial, and AI/ML libraries to power the monitoring, reporting, and verification (MRV) of restoration activities under WRI’s TerraFund program. Since 2022, TerraFund has channeled $32 million to nearly 200 restoration champions.\r\nI’ll walk through our rule-based decision support system—a Python tool built with requests and API-specific client libraries—that integrates multiple data streams to determine which projects should undergo remote or field verification. This approach helps us reduce uncertainty, optimize field missions, and improve cost planning. As part of our remote verification protocol, we deploy state-of-the-art computer vision models on high-resolution Maxar imagery to label trees and saplings with bounding boxes. Our data production process uses Python-based pipelines to query, order, and process imagery, then run inference to detect trees. This enables automated tree counting at scale, turning terabytes of imagery into actionable project-level verification. Finally, results are integrated into TerraMatch, our end-to-end platform connecting funders and restoration champions, and making insights about progress publicly accessible.\r\nAttendees will learn how Python acts as the connective tissue across APIs, AI/ML models, and geospatial workflows, and how these tools are helping us build scalable, transparent monitoring systems.",
    "code": "JV7TG9",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "building-trust-in-the-restoration-movement-with-python-ai-and-satellite-data",
    "speakers": [
      "BT38TD"
    ],
    "start": null,
    "title": "Building trust in the Restoration Movement with Python, AI, and Satellite Data",
    "track": "The Python programming language",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/building-trust-in-the-restoration-movement-with-python-ai-and-satellite-data",
    "youtube_url": null
  },
  "JWQWJ9": {
    "abstract": "I’m an experienced data analyst consultant working with data in international development, but I only started learning Python less than a year ago. As a beginner programmer with a passion for data visualization design, I began exploring how to build interactive dashboards with Python and Dash — not just to keep coding, but to share stories that matter deeply to me. \r\n\r\nIn this talk, I share key lessons learned so far — through a beginner’s lens — the shift from a rough idea to a working concept, choosing data, structuring the dashboard, and finding the balance between clarity and aesthetics in my design decisions. I’ll focus on one dashboard project as a case study to show what worked, what didn’t, and how I adapted along the way. Specifically, I will focus on correlations between malaria risk in children under 5 in Nigeria and other key indicators such as climate change and access to water and sanitation. \r\n\r\nI’ll also share my personal experience of troubleshooting when nothing seems to work, and how I kept motivation up when hope was dim. My goal is to encourage others to start their own “imperfect” projects, embrace iteration, and see learning as an ongoing process with both highs and lows.\r\n\r\nIf you’re curious about Python’s capabilities for data storytelling, want to explore interactive dashboards, or simply need that pep talk to begin your first Python project, this talk will offer insights, encouragement, and — most likely — a glimpse of your own journey reflected back at you.",
    "code": "JWQWJ9",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "from-fog-to-lighthouse-a-beginners-journey-from-raw-data-to-a-functional-dashboard",
    "speakers": [
      "UKNKWW"
    ],
    "start": null,
    "title": "From Fog to Lighthouse: A beginner’s journey from raw data to a functional dashboard",
    "track": "Useful Python libraries",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/from-fog-to-lighthouse-a-beginners-journey-from-raw-data-to-a-functional-dashboard",
    "youtube_url": null
  },
  "JXYZEN": {
    "abstract": "Governments generate vast amounts of data, but making it accessible, actionable, and engaging for the public remains a challenge. This session explores how the City of Austin, Texas, USA leverages Python to transform open data into interactive dashboards that foster transparency and empower citizens. Through real-world examples from Austin’s public sector projects, attendees will learn how data visualization and analytics can strengthen community engagement, enhance decision-making, and create a more informed society.",
    "code": "JXYZEN",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "democratizing-data-python-powered-dashboards-and-open-data-for-transparent-governance-in-austin",
    "speakers": [
      "ZY8XCZ"
    ],
    "start": null,
    "title": "Democratizing Data: Python-Powered Dashboards and Open Data for Transparent Governance in Austin",
    "track": "The Python programming language",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/democratizing-data-python-powered-dashboards-and-open-data-for-transparent-governance-in-austin",
    "youtube_url": null
  },
  "KMCPKM": {
    "abstract": "This novice-friendly project uses Python (plus Jekyll, a tried-and-true static site generator) to create an online cookbook that you and your friends can contribute to via email. I'll walk viewers through how I built this and why, and share source code for anyone interested in making their own cookbook.\r\n\r\nAttendees will get an overview of FastAPI, a handful of recipe parsing tools, and (if time allows) Jekyll. No knowledge of Jekyll is required, but you'll get the most out of this \"how I built this\" session if you have a basic understanding of Python.",
    "code": "KMCPKM",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "let-s-build-a-cookbook-in-python",
    "speakers": [
      "JG3EPU"
    ],
    "start": null,
    "title": "Let's Build A Cookbook In Python",
    "track": "Useful Python libraries",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/let-s-build-a-cookbook-in-python",
    "youtube_url": null
  },
  "KZJXTU": {
    "abstract": "Celery is a tool for asynchronous task execution and used widely in the Python community. If you understand terms like parallelism and asynchronous but aren't sure how to apply them in your projects, Celery is a great place to start. We'll be using an apple orchard (specifically Hello Kitty's cuz Why not?) as an allegory to put these computing terms into a real world context.",
    "code": "KZJXTU",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "celery-primitives-chain-group-signature-etc-demystified-on-hello-kitty-s-apple-orchard",
    "speakers": [
      "AMGWA8"
    ],
    "start": null,
    "title": "Celery Primitives (Chain, Group, Signature, etc.) Demystified on Hello Kitty's Apple Orchard",
    "track": "Useful Python libraries",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/celery-primitives-chain-group-signature-etc-demystified-on-hello-kitty-s-apple-orchard",
    "youtube_url": null
  },
  "MGAN8V": {
    "abstract": "Esta palestra é destinada para ser uma introdução ao PySpark, a API Python para executar o Apache Spark, com foco na aplicação em engenharia de dados. Serão apresentados os principais conceitos, como processamento distribuído, criação de DataFrames e operações de transformação. O objetivo é mostrar e simplificar o PySpark para iniciantes na área de Engenharia de Dados.",
    "code": "MGAN8V",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "pt",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "introducao-ao-pyspark-para-engenharia-de-dados",
    "speakers": [
      "Z3U7JW"
    ],
    "start": null,
    "title": "Introdução ao PySpark para Engenharia de Dados",
    "track": "Others",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/introducao-ao-pyspark-para-engenharia-de-dados",
    "youtube_url": null
  },
  "MU3PDT": {
    "abstract": "From Volunteer to Organizer: Growing with PyLadies Seoul\r\nI began my journey with PyLadies Seoul as a volunteer at PyCon KR, and quickly resonated with the community’s mission of building an inclusive space for women developers. Inspired, I joined as an organizer, contributing to our year-end celebration, leading the Fluent Python study group, and participating in PyCon KR 2025.\r\nAlong the way, I connected with PyLadies chapters from other countries and collaborated with fellow organizers to drive meaningful change. Together, we successfully rebooted PyLadies Seoul, creating a vibrant, welcoming space for women from diverse backgrounds.\r\nThis talk shows how small steps of engagement can grow into leadership and impact. If you’ve ever wondered how to move from participant to contributor, my story demonstrates that starting where you are—with curiosity and care—can make a difference.",
    "code": "MU3PDT",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "from-volunteer-to-organizer-growing-with-pyladies-seoul",
    "speakers": [
      "UHQVKU"
    ],
    "start": null,
    "title": "From Volunteer to Organizer: Growing with PyLadies Seoul",
    "track": "The Python community",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/from-volunteer-to-organizer-growing-with-pyladies-seoul",
    "youtube_url": null
  },
  "NLGURP": {
    "abstract": "An astonishing 96.3% of websites have accessibility issues. Turning this number around is not just a job for frontend developers. Python developers can help too! In this talk, I'll introduce you to the Web Content Accessibility Guidelines and show you practical ways to incorporate accessibility into your Python web development. I'll walk through examples created with a Python-powered content management system called Wagtail CMS. By the end of this talk, you'll learn the key ways Python developers can enhance web accessibility and you'll leave with a hands-on tutorial to build your own more accessible website.",
    "code": "NLGURP",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "building-more-accessible-python-powered-websites",
    "speakers": [
      "HM3RRT"
    ],
    "start": null,
    "title": "Building more accessible Python-powered websites",
    "track": "Web development",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/building-more-accessible-python-powered-websites",
    "youtube_url": null
  },
  "QQDM7H": {
    "abstract": "Ever spent 40 minutes choosing a movie, only to rewatch something you didn’t even love?\r\n\r\nIn this talk, I’ll share how I built Movie Groovy, a Python-based app that recommends movies based on how you feel. I’ll walk through how I used tools like FastAPI, Qdrant, Gemini (and some more) to create emotionally-aware suggestions, combining filtering logic, a lightweight Retrieval-Augmented Generation (RAG) approach, and an agentic flow that guides users step-by-step through their choices, for a more personalized experience.\r\n\r\nMore than the stack, we’ll explore why empathy matters in AI, how user feedback shaped the design, and how you can build meaningful tools using open-source solutions, even as a solo dev.\r\n\r\nIf you’re into Python, curious about AI beyond the hype, or just want to build things that feel more human, this talk is for you.",
    "code": "QQDM7H",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "movie-groovy-building-a-mood-based-recommender-with-python-and-empathy",
    "speakers": [
      "8T7CFD"
    ],
    "start": null,
    "title": "Movie Groovy: Building a Mood-Based Recommender with Python and Empathy",
    "track": "AI / ML",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/movie-groovy-building-a-mood-based-recommender-with-python-and-empathy",
    "youtube_url": null
  },
  "QQRHRF": {
    "abstract": "Forecasting isn’t just about numbers, it’s about making the future understandable and actionable. TimeCopilot (https://timecopilot.dev/) is an open-source Python agent that combines large language models with time-series foundation models to automate, explain, and interact with forecasts. In this talk, I’ll share how we orchestrate Python-based agent workflows with tools like PydanticAI and Hugging Face to bridge the gap between statistical accuracy and human-friendly insights. We’ll walk through real examples, lessons learned from building for the open-source community, and how agentic systems can make forecasting more accessible to everyone.",
    "code": "QQRHRF",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "timecopilot-the-genai-forecasting-agent",
    "speakers": [
      "FSVYU9"
    ],
    "start": null,
    "title": "TimeCopilot: The GenAI Forecasting Agent",
    "track": "AI / ML",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/timecopilot-the-genai-forecasting-agent",
    "youtube_url": null
  },
  "QUZXXK": {
    "abstract": "PT: Descubra o Pituguês: um dialeto de Python em português! Explore suas origens, exemplos práticos e como ele pode tornar a programação mais inclusiva e acessível para pessoas iniciantes e não falantes da língua inglesa.\r\n\r\nEN: Discover Pituguês: a Python dialect in Portuguese! Explore its origins, practical examples, and how it can make programming more inclusive and beginner-friendly.",
    "code": "QUZXXK",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "pt",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "pitugues-python-em-portugues",
    "speakers": [
      "QCZ7SY"
    ],
    "start": null,
    "title": "Pituguês: Python em Português",
    "track": "Education",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/pitugues-python-em-portugues",
    "youtube_url": null
  },
  "QZFBCH": {
    "abstract": "本場分享將回顧講者自 2016 年起在 PyLadies Taiwan 的經驗，從擔任 Host 到退居幕後，逐步累積近十年的實踐與觀察，內容將聚焦在：\r\n1. 如何在不同發展方向間取得平衡、決定社群成長的步調與樣貌，鼓勵更多志願者走上領導之路。\r\n2. 如何在細節裡守護活動品質與參與者體驗。\r\n\r\n希望透過這些實際案例，給予正在經營或參與社群的你一些靈感：如何長期維護一個技術社群，更能不斷培育新能量，在世代交替間持續茁壯。",
    "code": "QZFBCH",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "zh-hant",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "shi-nian-zhi-lu-cong-host-dao-mu-hou-pyladies-taiwan-she-qun-jing-ying-de-xin-fa-yu-shi-jian",
    "speakers": [
      "9G37BP"
    ],
    "start": null,
    "title": "十年之路：從 Host 到幕後，PyLadies Taiwan 社群經營的心法與實踐",
    "track": "Leadership skills",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/shi-nian-zhi-lu-cong-host-dao-mu-hou-pyladies-taiwan-she-qun-jing-ying-de-xin-fa-yu-shi-jian",
    "youtube_url": null
  },
  "R9NZ7G": {
    "abstract": "Many Python developers write code that works beautifully until it lands in production and something breaks. Suddenly, the bug isn’t in the logic, it’s in what you didn’t see coming. Without proper logging, metrics, or monitoring, it’s hard to answer even basic questions like: “Is this function working as expected?”, “Why did this job fail?”, or “How many users are affected?”\r\n\r\nThis talk is for anyone who’s deployed (or wants to deploy) Python apps and has ever struggled to debug or monitor them after launch. I’ll introduce the concept of observability but without the buzzwords or complexity. Through real-life scenarios, I’ll explain how even a few lines of thoughtful logging and some basic metrics can transform one’s code from “it works on my machine” to “I can debug this at 2 AM.”\r\n\r\nWe’ll walk through examples of poor vs. effective logging, how metrics reveal patterns logs can’t, and how monitoring ties it all together. Whether one is building web apps, CLIs, or automation scripts, this talk will show how one can start writing more observable Python.",
    "code": "R9NZ7G",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "the-python-you-didnt-write-understanding-logs-metrics-and-monitoring-for-better-production-code",
    "speakers": [
      "Z98SEA"
    ],
    "start": null,
    "title": "The Python You Didn’t Write: Understanding Logs, Metrics, and Monitoring for Better Production Code",
    "track": "The Python programming language",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/the-python-you-didnt-write-understanding-logs-metrics-and-monitoring-for-better-production-code",
    "youtube_url": null
  },
  "RURANB": {
    "abstract": "Making faster and memory efficient programs matter. A fast product gives you more customer conversions and shrinks your carbon footprint. To write efficient programs, you need to understand the life cycle of your program inside the server. Where does it live? How does it get executed? What helps it execute faster? Follow the life of your program with Lilliputians - tiny people who can help you understand the flow of your data.",
    "code": "RURANB",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "what-you-need-to-know-about-computer-memory-as-a-programmer-as-explained-by-lilliputians",
    "speakers": [
      "PEGZDM"
    ],
    "start": null,
    "title": "What you need to know about computer memory as a programmer, as explained by Lilliputians",
    "track": "Others",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/what-you-need-to-know-about-computer-memory-as-a-programmer-as-explained-by-lilliputians",
    "youtube_url": null
  },
  "SNLZFB": {
    "abstract": "Python is one of the most widely used programming languages in the world, but understanding how it works under the hood can be a challenge. Even though it is open source, there are very few accessible resources to explore CPython—its reference implementation in C—and even fewer if English is not your first language. But what if, instead of writing `if`, we could write `si`? What if `print()` became `imprimir()`? And what if, while transforming Python into Spanish, we learned how Python itself is built?\r\n\r\nIn this talk, we’ll explore what CPython is and how to compile it, why Python is written in C instead of Python, and how its grammar and parser work. Finally, we’ll put this knowledge into action by changing Python’s keywords into Spanish—`if` becomes `si`, `for` becomes `para`, and `while becomes `mientras`.\r\n\r\nBy learning how CPython works internally, you’ll gain a deeper understanding of why certain things work (and why some errors happen), experiment with new language features, create your own extensions, and maybe even contribute back to CPython itself. And although it may sound intimidating, CPython is not an untouchable project—you’ll see that it’s more approachable than you think.\r\n\r\nWhile the examples in this talk are in Spanish, the approach can be adapted to *any* natural language, including **yours**!\r\n\r\nThis talk is aimed at Python users with intermediate knowledge who are curious about how the language is implemented. No prior experience with C, compilers, or language theory is required—just a willingness to learn something new.",
    "code": "SNLZFB",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "how-to-teach-your-language-to-python-with-cpython",
    "speakers": [
      "EXVYFF"
    ],
    "start": null,
    "title": "How to teach your language to Python (with CPython!)",
    "track": "The Python programming language",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/how-to-teach-your-language-to-python-with-cpython",
    "youtube_url": null
  },
  "SXJPB7": {
    "abstract": "The free and open-source software community is an astonishing global feat of human collaboration, independently of the software that it creates. Taking a more active role in this community offers significant potential benefits, but also plenty of opportunities for frustration and disappointment. Sparing some time for personal reflection on the question posed in this talk can go a long way towards making our community interactions a positive experience for all involved.",
    "code": "SXJPB7",
    "delivery": "",
    "duration": "30",
    "end": null,
    "language": "en",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Keynote",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "do-you-want-to-get-more-involved-in-open-source",
    "speakers": [
      "FYVKMX"
    ],
    "start": null,
    "title": "Do you want to get more involved in open source?",
    "track": "Community management",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/do-you-want-to-get-more-involved-in-open-source",
    "youtube_url": null
  },
  "UAJAKB": {
    "abstract": "Acquisition of satellite imagery, frequently becomes corrupted by various forms of noise, which degrades image quality and impedes accurate interpretation and subsequent analysis. This paper presents a novel, integrated approach for effective noise removal from such imagery, utilizing the capabilities of the Wavelet transform based thresholding, Singular Value Decomposition (SVD), and also autoencoders. The Wiener filter, proves adept at addressing stationary noise, particularly effective in suppressing additive Gaussian noise whilst preserving important details based on local statistics. Following this, SVDs are employed to exploit the inherent low-rank structure characteristic of natural images, enabling further noise reduction by reconstructing the image from its more significant singular values, thereby separating signal from noise components. Finally, an autoencoder, which is are powerful deep learning architecture, is then utilized for its capacity to learn complex, non-linear representations from noisy inputs. This data-driven strategy allows the autoencoder to effectively apprehend intricate noise patterns and reconstruct high-fidelity images, offering particular benefit for complex or non-stationary noise types where traditional filters may struggle. By combining these complementary techniques, the proposed methodology aims for superior noise suppression, the preservation of crucial image features, and the enhancement of overall visual quality and analytical utility of satellite images. Expected results demonstrate significant improvements in signal-to-noise ratio and perceptual quality compared to individual methods, highlighting the synergistic benefits of this combined framework.",
    "code": "UAJAKB",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "a-low-cost-automatic-compressing-and-noise-removing-algorithm-for-satellite-images",
    "speakers": [
      "NKJDAR"
    ],
    "start": null,
    "title": "A Low-cost automatic compressing and noise-removing algorithm for satellite images.",
    "track": "AI / ML",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/a-low-cost-automatic-compressing-and-noise-removing-algorithm-for-satellite-images",
    "youtube_url": null
  },
  "VMQTME": {
    "abstract": "Communication has long been a necessary skill for data professionals, but most folks stop with simply data visualization and data storytelling. \r\n\r\nAs a former marketing and PR manager, my seemingly “unrelated” experience has been a huge asset to my career in analytics and data science. We all know how to craft a story with data and create a compelling visualization. But do you know how to craft the story of the value of your team and build trust? How to create a compelling business case for your projects? How to get buy-in and communicate impact? \r\n\r\nPR is necessary for data teams, even if it’s just internal. Does the rest of the company know who you are? Does your team have a good reputation? Are you trusted advisors? Do you have evangelists who tell your stories for you? \r\n\r\nIn this talk, I will share lessons from my previous career in public relations and marketing and how they apply to your work as a data professional.",
    "code": "VMQTME",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "public-relations-for-data-teams-how-to-increase-impact-by-building-trust",
    "speakers": [
      "VDTPUP"
    ],
    "start": null,
    "title": "Public Relations for Data Teams: How to increase impact by building trust",
    "track": "Community management",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/public-relations-for-data-teams-how-to-increase-impact-by-building-trust",
    "youtube_url": null
  },
  "VN37NU": {
    "abstract": "Ever wondered what happens to your data after you delete your account? While the database might forget you, the AI models trained on your data still \"remember\" your patterns. This talk introduces machine unlearning - the fascinating field of teaching AI to truly forget.\r\n\r\nIn this beginner-friendly session, you'll discover why machine unlearning matters more than ever. From GDPR's \"right to be forgotten\" to removing bias from hiring algorithms, the ability to make AI forget specific information is crucial for privacy, fairness, and safety.\r\nI'll demonstrate some practical and theoretical Python approaches you can implement today:\r\n\r\n1. SISA Framework - Split training data into shards, making forgetting 5x faster than retraining fromscratch\r\n2. Gradient Ascent - Teach models to be confidently wrong about specific data \r\n3. Strategic Noise Injection - Add controlled noise to confuse AI about unwanted memories\r\n\r\nI'll explain the key concepts and walk through Python examples, showing how different unlearning approaches work in practice. While some advanced techniques exist, I'll focus on methods that are approachable for those getting started with machine learning.\r\n\r\nWhether you're building your first ML model or working on production systems, understanding machine unlearning helps you create more ethical and privacy-conscious AI. You'll leave with practical code examples, resources for further learning, and a new perspective on responsible AI development.\r\nYou just need curiosity about making AI more trustworthy and accountable.",
    "code": "VN37NU",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": [
      {
        "description": "Ctrl + z for machine : The Art of Machine Unlearning",
        "resource": "https://medium.com/@swabhimankhadka2001/ctrl-z-for-machine-the-art-of-machine-unlearning-583975418c2e"
      }
    ],
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "main-character-energy-taking-back-control-of-your-data-from-ai",
    "speakers": [
      "LKLNAE"
    ],
    "start": null,
    "title": "Main Character Energy: Taking Back Control of Your Data from AI",
    "track": "AI / ML",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/main-character-energy-taking-back-control-of-your-data-from-ai",
    "youtube_url": null
  },
  "WRPAMN": {
    "abstract": "Ser mujer en tecnología no es solo ocupar un espacio en un sector históricamente dominado por hombres: es transformar la manera en que lideramos, innovamos y construimos futuro. En esta charla exploraremos cómo el liderazgo femenino puede convertirse en una fuerza catalizadora dentro de la industria del software, impulsando culturas más humanas, colaborativas y de alto desempeño.\r\n\r\nDurante 30 minutos recorreremos los desafíos y oportunidades de liderar en el mundo tech desde la autenticidad, la visión estratégica y la empatía. Hablaremos de herramientas prácticas para desarrollar liderazgo técnico y organizacional, gestionar talento diverso, fomentar la innovación y construir equipos autónomos que escalan sin perder su esencia.\r\n\r\nTambién abordaremos las claves para crecer como líder: cómo navegar entornos de alta complejidad, ganar influencia sin perder la voz propia, y convertir la diversidad en una ventaja competitiva. A través de ejemplos reales, compartiré aprendizajes sobre cómo crear entornos donde las personas puedan brillar, las ideas fluyan y la excelencia se sostenga en el tiempo.\r\n\r\nEsta charla es una invitación a repensar el liderazgo desde el ADN femenino: más colaborativo que jerárquico, más orientado al propósito que al control, y profundamente consciente de que la tecnología no solo resuelve problemas, sino que moldea la forma en que habitamos el mundo.",
    "code": "WRPAMN",
    "delivery": "",
    "duration": "30",
    "end": null,
    "language": "es",
    "level": "intermedio",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Keynote",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "liderazgo-femenino-en-el-mundo-tech",
    "speakers": [
      "9XSYUK"
    ],
    "start": null,
    "title": "Liderazgo femenino en el mundo Tech",
    "track": "Habilidades de liderazgo",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/liderazgo-femenino-en-el-mundo-tech",
    "youtube_url": null
  },
  "WZTMVK": {
    "abstract": "En esta charla mostraré cómo Python, gracias a sus librerías de código abierto, permite pasar rápidamente de un conjunto de datos con coordenadas a un mapa visual y atractivo. Usaremos ejemplos prácticos con herramientas como folium, geopandas y plotly.express para crear desde mapas simples hasta visualizaciones interactivas. La idea es que cualquier persona, incluso sin experiencia previa en GIS, pueda entender y aplicar estos conceptos para contar historias con datos geográficos.",
    "code": "WZTMVK",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "es",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "de-coordenadas-a-colores-visualizando-el-mundo-con-python",
    "speakers": [
      "KQHVSU"
    ],
    "start": null,
    "title": "De coordenadas a colores: visualizando el mundo con Python",
    "track": "Useful Python libraries",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/de-coordenadas-a-colores-visualizando-el-mundo-con-python",
    "youtube_url": null
  },
  "XGNKTB": {
    "abstract": "MkDocs is a really simple tool to quickly create a static web site. I use it to quickly create web pages from basic markdown files.\r\nRecently I have also used Material for MkDocs to create a new version of my personal web page and it has been a really easy.\r\nIf you do not have much time, MkDocs is a nice solution to quickly publish some web content.",
    "code": "XGNKTB",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "fr",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "creer-facile-un-site-web-avec-mkdocs-easily-create-a-website-with-mkdocs",
    "speakers": [
      "HEUNYT"
    ],
    "start": null,
    "title": "Créer facile un site web avec MkDocs / Easily create a website with MkDocs",
    "track": "Useful Python libraries",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/creer-facile-un-site-web-avec-mkdocs-easily-create-a-website-with-mkdocs",
    "youtube_url": null
  },
  "XW9BLX": {
    "abstract": "この講演では、ブラジルに根付いた日本人移民コミュニティの歴史と、Pythonを通じて文化交流を促進する可能性について紹介します。1908年に始まった日本人のブラジル移住は、現在ではサンパウロ州のリベルダージ地区やバストス、パラナ州のロンドリーナ、パラー州のトメアスなど、各地に強い影響を残しています。\r\n\r\n農業、教育、祭り、食文化など、地域ごとの特色を持つ日本人コミュニティは、ブラジルの多様性の一部となっています。この講演では、Pythonを使ってポルトガル語と日本語のコミュニケーションを支援する方法を紹介し、言語の壁を越えて協力できる可能性を探ります。\r\n\r\nまた、翻訳ライブラリ（argostranslateやdeep-translator）を活用することで、地域イベントや教育活動において、より円滑な交流が可能になります。技術は単なるツールではなく、文化と人をつなぐ架け橋です。",
    "code": "XW9BLX",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "ja",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "hurasirunigen-fu-itari-ben-pythontetunakaruyi-min-noli-shi-todi-yu-wen-hua",
    "speakers": [
      "TCA73V"
    ],
    "start": null,
    "title": "「ブラジルに根付いた日本：Pythonでつながる移民の歴史と地域文化」",
    "track": "The Python community",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/hurasirunigen-fu-itari-ben-pythontetunakaruyi-min-noli-shi-todi-yu-wen-hua",
    "youtube_url": null
  },
  "YHBWR8": {
    "abstract": "Tech is still not built for everyone. From 15 years navigating the industry as an underrepresented professional, I’ll share survival strategies to not just stay, but thrive in tech.",
    "code": "YHBWR8",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "survival-guide-in-tech-for-underrepresented-groups",
    "speakers": [
      "GXBKTT"
    ],
    "start": null,
    "title": "Survival Guide in Tech for Underrepresented Groups",
    "track": "Others",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/survival-guide-in-tech-for-underrepresented-groups",
    "youtube_url": null
  },
  "YKRHA3": {
    "abstract": "We've all been there: staring at a frozen app, a stalled progress bar. Annoying, right? But in medical robotics, a software malfunction can be the difference between success and failure during a surgical study. \r\n\r\nIn **lung cancer diagnoses**, a 3D Convolutional Neural Network (CNN) that is trained to assist is just a promise until a robust MLOps pipeline makes it a reality. \r\n\r\nA model in a hospital isn't just about accuracy; it's about **unwavering reliability and minimizing downtime** in a secure, on-premise environment. This talk is a deep dive into the code that ensures that trust.",
    "code": "YKRHA3",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "trust-me-i-m-a-robot-mlops-for-medtech",
    "speakers": [
      "WWKB3X"
    ],
    "start": null,
    "title": "Trust Me, I'm a Robot: MLOps for MedTech",
    "track": "AI / ML",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/trust-me-i-m-a-robot-mlops-for-medtech",
    "youtube_url": null
  },
  "YL3LZC": {
    "abstract": "When beginners start learning Python, they often understand the idea of fixing errors but don’t fully connect it to the hands-on process of debugging. I learned this firsthand while building a production application, where the project’s size and complexity pushed my debugging skills to the limit.\r\n\r\nIn this talk, I will break down a beginner-friendly toolkit for finding and fixing bugs in Python. We’ll start with making sense of error messages and learning how to read a traceback without panicking. Attendees will explore how to use tools like print() and assert strategically, and why exceptions and logging can be lifesavers when things go wrong.\r\n\r\nWe will also tackle common beginner pitfalls, from harmless typos to sneaky logical errors, and share practical techniques for spotting them faster.\r\n\r\nBy the end, attendees will walk away not just knowing how to debug, but with the confidence to face errors head-on, whether working on a small script or a large project.",
    "code": "YL3LZC",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "so-it-broke-now-what-debugging-python-101",
    "speakers": [
      "7Q3TSS"
    ],
    "start": null,
    "title": "So It Broke… Now What? Debugging Python 101",
    "track": "The Python programming language",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/so-it-broke-now-what-debugging-python-101",
    "youtube_url": null
  },
  "ZGPVCU": {
    "abstract": "Reasoning is one of the most powerful—and sometimes surprising—capabilities in large language models. In this talk, we’ll demystify what “reasoning” means, how intermediate steps improve problem-solving, and why certain techniques—like Chain-of-Thought, Self-Consistency, RL-based reasoning, and distilled reasoning models—can unlock smarter behavior. We’ll also explore how reasoning can emerge naturally through reinforcement learning. Through practical examples in generative and agentic AI, we’ll cover when reasoning delivers value, its trade-offs, and how to optimize context for better performance. Attendees will leave with a clear framework for applying reasoning models effectively.",
    "code": "ZGPVCU",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "en",
    "level": "intermediate",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "from-chain-of-thought-to-agentic-ai-demystifying-reasoning-in-llms",
    "speakers": [
      "Z87LT8"
    ],
    "start": null,
    "title": "From Chain-of-Thought to Agentic AI: Demystifying Reasoning in LLMs",
    "track": "AI / ML",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/from-chain-of-thought-to-agentic-ai-demystifying-reasoning-in-llms",
    "youtube_url": null
  },
  "ZQ98FN": {
    "abstract": "Esta charla aborda de manera introductoria la aplicación de la ética en la IA, específicamente en términos de interpretabilidad y cómo la opacidad de estos modelos genera riesgos tanto técnicos como sociales en un contexto de adopción acelerada.\r\n\r\nAnalizaremos casos reales donde la falta de transparencia en los procesos de toma de decisiones ha llevado a consecuencias inesperadas. Además, veremos cómo los sistemas que han traído el auge comercial a la inteligencia artificial (los modelos de lenguaje natural) cuentan con mecanismos ocultos que, afortunadamente, se han comenzado a analizar. Con esto, la audiencia podrá conformar una opinión sobre qué tanto hay detrás de cada una de las respuestas que parecen coherentes y neutrales.\r\n\r\nFinalmente, dentro de la charla exploraremos cómo los sistemas de IA se han convertido en infraestructuras sociotécnicas que requieren perspectivas multidisciplinarias, y cómo nosotros, como usuarios o desarrolladores, tenemos cabida desde una perspectiva más analítica y participativa en este ecosistema.",
    "code": "ZQ98FN",
    "delivery": "",
    "duration": "20",
    "end": null,
    "language": "es",
    "level": "beginner",
    "next_session": null,
    "prev_session": null,
    "resources": null,
    "room": null,
    "session_type": "Talk",
    "sessions_after": null,
    "sessions_before": null,
    "sessions_in_parallel": null,
    "slug": "etica-en-la-ia-un-espacio-comun-para-construir-en-conjunto",
    "speakers": [
      "GMSKCP"
    ],
    "start": null,
    "title": "Ética en la IA: un espacio común para construir en conjunto",
    "track": "AI / ML",
    "tweet": "",
    "website_url": "https://2025.conference.pyladies.com/session/etica-en-la-ia-un-espacio-comun-para-construir-en-conjunto",
    "youtube_url": null
  }
}